[{"id":314,"posted_on":"2024-11-29","company":"Nift","company_logo":"https://remotive.com/job/1953414/logo","position":"Corporate Counsel","category":"Finance / Legal","tags":"{\"intellectual property\"}","salary":"competitive pay, unlimited responsible pto","location":"USA","apply_url":"https://remotive.com/remote-jobs/finance-legal/corporate-counsel-1953414","description":"Nift is disrupting performance marketing, delivering millions of new customers to brands every month. We’re actively looking for a Corporate Counsel to join our team.\nOur mission is to reshape how people discover and try new brands by introducing them to new products and services through thoughtful \"thank-you\" gifts. Our customer-first approach ensures businesses acquire new customers efficiently while making customers feel valued and rewarded. We are a well-managed, data-driven, cash-flow-positive company that has experienced 100% YoY growth for three consecutive years. Now, we’re scaling to become one of the largest sources for new customer acquisition worldwide. Backed by investors who supported Fitbit, Warby Parker, and Twitter, we are poised for exponential growth and ready to demonstrate impact on a global scale.\nThe Role:\nWe are seeking our very first legal hire. This is a greenfield opportunity for the right Corporate Attorney. As a key member of our team, you will report to our Vice President/Head of Finance & Accounting and be responsible for all things legal. You will provide strategic legal guidance and ensure compliance with relevant laws and regulations. Your expertise will be instrumental in shaping Nift's legal landscape and supporting our growth trajectory.\nWhat you will do:\n\nDrafting and Reviewing Contracts: Prepare, review, and negotiate a wide variety of corporate contracts, including partnership and customer contracts, vendor agreements, NDAs, and, ensuring compliance with company policies and applicable laws.\nContract Lifecycle Management: Oversee the end-to-end contract lifecycle, from initiation and negotiation to execution, renewal, and termination.\nContract Risk Assessment: Identify, assess, and mitigate potential risks in contractual terms and conditions, ensuring alignment with organizational objectives and legal requirements.\nData Privacy: Review existing privacy policy and company procedures and evolve as necessary to stay compliant with applicable laws in jurisdictions where we operate. Collaborate with product and engineering teams to promote privacy by design and implement data protection best practices.  \nInternational Expansion: create the legal roadmap to support our growth into new international markets\nHR: apply understanding of employment laws, including matters in hiring, termination, employment contracts, \nIntellectual Property: apply knowledge of intellectual property laws to protect trademarks, copyrights, and patents.  Lead the process for obtaining IP protection in new markets\nInsurance Program: review and manage our comprehensive insurance program, ensuring our policies have appropriate coverage given our business model, size geographies, and contractual obligations\nCorporate Policies and Procedures: Develop, implement, and maintain corporate governance policies, procedures, and best practices in alignment with applicable laws, regulations, and industry standards.\nOutside Counsel: Work with and efficiently manage current outside counsel.  As needed from time-to-time, select, engage, and manage additional expert outside counsel  \nCorporate Transactions: Provide legal support for any potential financing activities and other corporate transactions\n\nWhat you need:\n\n5+ years experience post-law school \n2+ years experience as in-house counsel for a consumer-facing technology company, preferably for a venture-backed early stage company, collaborating with sales and product teams\nIn-depth experience with drafting and negotiating contracts & agreements\nExpertise in data privacy regulations and cybersecurity laws (GDPR, CCPA)\nPrivacy by design experience, CIPP certified information privacy professional a plus\nKnowledge of digital advertising platforms and standards a plus\nExperience in international business expansion\nA Juris Doctor (JD) degree from a reputable accredited law school\nActive bar membership, licensed to practice law in the relevant jurisdiction\nStrong attention to detail, very organized, with ability to appropriately prioritize projects \nIndependent, self driven, with good business acumen\nStrong communication skills, articulate, and with the ability to influence others \nExcellent analytical and problem-solving skills \nAbility to stay updated on rapidly evolving technology trends and legal developments\n\nWhat we offer:\n\nGreat opportunity to join a high growth, profitable tech startup as the first legal hire and contribute to Nift's continued success and growth trajectory\nCompetitive pay, Unlimited responsible PTO\nRemote working arrangements\nOperate independently with ownership of responsibilities\n"},{"id":315,"posted_on":"2024-11-29","company":"Integral Ad Science","company_logo":"https://remotive.com/job/1953629/logo","position":"Senior Technical Program Manager","category":"Project Management","tags":"{saas,scrum,agile,\"project management\",research,\"program manager\",\"scrum master\",\"computer science\",diversity,catalyst}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/project-management/senior-technical-program-manager-1953629","description":"As a Senior Technical Program Manager you will champion stakeholder satisfaction by leading and empowering cross-functional teams in accelerating the delivery of program initiatives. This is a newly created position within a growing TPM function, and you will have the opportunity to help shape a modern technical program management organization. If you are someone who is excited about making a direct impact on the tech roadmap, partnering with leaders across the organization to find innovative solutions to complex problems, and bringing structure and processes to help teams be more efficient, this could be an exciting opportunity for you! \nWhat you’ll get to do: \n\nLead large-scale, complex, multi-disciplinary engineering projects and initiatives that drive customer value and impact for our users \nManage technology focused discussions with senior leadership by providing valuable insights and recommendations that guide technology-based and data-driven decisions\nLead programs by achieving alignment on program scope, release planning, as well as aligning one or more teams on vision, business goals, creating program structure, and securing cross-functional alignment\nBe a key member in building out and expanding the TPM function across the R&D organization, including driving engineering strategy, defining OKRs and KPIs, and building out supporting processes and procedures\nBe a catalyst within the organization – help drive change and advance our Research & Development strategy globally, including building our engineering brand, and developing a learning and knowledge sharing initiative to name a few\nProvide visibility to program status report (issues, risks, metrics, etc.) on an ongoing basis to all stakeholders and team members\nIdentify and take ownership of tasks to improve developer/engineer efficiency to maximize developer hands on keyboards and minimize unnecessary meetings and communications\nImplement processes that drive accountability and integrity in estimation practices by utilizing data-driven insights from historical performance\nAct as a scrum master for development teams. This includes assigning and delegating  tasks appropriately, ensuring the team’s work aligns with priorities and overall schedule, and ensuring the team is fully deployed to name a few\n\nYou should apply if you have most of this experience: \n\n5-6+ years experience in technical program management or operational role \nBA/BS degree in engineering, computer science, or similar degree \nPrior experience leading large scale, enterprise programs within a software or SaaS environment\nProven track record of data-driven decision making and applying continuous improvement methodologies across teams\nStrong communication and proven ability to develop relationships, credibility, and rapport with senior executives, technical and non-technical team members \nDeep experience with the software development lifecycle; ability to adjust and apply this knowledge in a dynamic environment using agile methodologies and best practices \nExcellent analytical and problem-solving skills with a history of hands-on, detail, and action orientation\nStrong attention to detail and prior experience managing competing and high priority tasks\nExtensive project management experience and understanding of supporting frameworks, methodologies, and toolsets\n\nAbout Integral Ad Science\n\nIntegral Ad Science (IAS) is a leading global media measurement and optimization platform that delivers the industry’s most actionable data to drive superior results for the world’s largest advertisers, publishers, and media platforms. IAS’s software provides comprehensive and enriched data that ensures ads are seen by real people in safe and suitable environments, while improving return on ad spend for advertisers and yield for publishers. Our mission is to be the global benchmark for trust and transparency in digital media quality. For more information, visit integralads.com.\n\nEqual Opportunity Employer:\nIAS is an equal opportunity employer, committed to our diversity and inclusiveness. We will consider all qualified applicants without regard to race, color, nationality, gender, gender identity or expression, sexual orientation, religion, disability or age. We strongly encourage women, people of color, members of the LGBTQIA community, people with disabilities and veterans to apply.\nCalifornia Applicant Pre-Collection Notice:\nWe collect personal information (PI) from you in connection with your application for employment or engagement with IAS, including the following categories of PI: identifiers, personal records, commercial information, professional or employment or engagement information, non-public education records, and inferences drawn from your PI. We collect your PI for our purposes, including performing services and operations related to your potential employment or engagement. For additional details or if you have questions, contact us at compliance@integralads.com.\nTo learn more about us, please visit http://integralads.com/ \nAttention agency/3rd party recruiters: IAS does not accept any unsolicited resumes or candidate profiles. If you are interested in becoming an IAS recruiting partner, please send an email introducing your company to recruitingagencies@integralads.com. We will get back to you if there's interest in a partnership.\n#LI-Remote"},{"id":316,"posted_on":"2024-11-29","company":"Decoded Limited","company_logo":"https://remotive.com/job/1953631/logo","position":"Product Operations Manager","category":"Project Management","tags":"{excel}","salary":"£35,000 - £40,000","location":"UK","apply_url":"https://remotive.com/remote-jobs/project-management/product-operations-manager-1953631","description":"ABOUT DECODEDWe are Decoded, the pioneers of transformative technology education. We democratise cutting-edge skills. We help transform traditional businesses into tech companies. We give our learners the skills and confidence to embrace the future of work.Our products and methodologies have been shaped through our collaboration with some of the largest and most technologically progressive organisations in the world. We use the intelligent, ethical, and creative application of technology to lay the foundations for a more productive and promising world – one with unlimited possibilities.OVERVIEWAs a Product Operations Manager you will manage the operational processes, logistics, platforms and systems that underpin the delivery and development of our learning programmes. The success of this role will be measured by your ability to optimise product development efficiency and effective product delivery.The Product Operations team focuses on ensuring effective connection and clear communication flows back and forth between Commercial, Solution and Product. As the Product Operations Manager you will act as the catalyst for effective planning and alignment of product development between Product Developers, LXD specialists and our network of associates with subject matter expertise.This is a fantastic opportunity for someone who is passionate about improving the way people and systems work to provide premium operational delivery of Decoded’s global learning programmes. 🚀ACCOUNTABILITIESAs a Product Operations Manager at Decoded, you are accountable for:Learning product logistics and planning: managing, scheduling of our learning productsProduct development, scrum mastery and coaching: working with product developers to plan and deliver projects, facilitating meetings, supporting them to meet deadlines and maintain clarity of progress, remove blockers and adhering to Decoded’s Definition of DoneProcess management and improvement: creating better flow of work and making work more predictable through process improvement and better utilisation of toolsCross functional alignment and communication: reducing friction and troubleshooting across our tech stack working with stakeholders across the businessSPECIFIC ROLE & RESPONSIBILITIESLearning product logistics and planningManage scheduling and logistics of our apprenticeship and commercially funded learning programmes to ensure efficient and robust operational delivery is in place day in, day outBe the operational contact for the facilitation team during sessions should the team need additional supportCreate and prioritise the product development plans as a source of truth for the cross-functional team working on product development and deliverySupport the maintenance of the product content databases across our tech stack, including planning for new products and surfacing gaps in existing documentationWork closely with peers to deliver outstanding operational experiences to learners attending our workshopsOptimising operational processes and resources specific to teaching mode - both in-person and virtual deliveryProduct development Scrum Master coachingAssist with pre-planning & scheduling for upcoming programmes with other stakeholders in the business. Manage  product development as scrum master to the teams developing our learning programmesManage the gathering & communication of information to optimise  delivery timelines for our customers, working in partnership with Product solution lead Facilitate team discussion  to effectively problem solve and plan collaboratively to ensure learning programme development stays on target for delivery timelinesOrganise, facilitate and document key development team touch points as a scrum master to unblock, progress and enhance the successful development of learning programmesSetting a tone of over-communication between the product development team to ensure effective collaboration and escalation issues where appropriateProcess management and improvementHighlight places for  process improvements and champion initiatives to implement best practices for product operations including our tech stack using a digital-first approachExplore SaaS platform functionality to utilise the potential in our current operational solutionsSKILLS & BEHAVIOURSYour performance will be measured by and driven by a mindset built on: Striving for excellence in everything you do. You don’t accept mediocrity in yourself or the team around you.  Building brilliant, collaborative and productive relationships with colleagues and partners alike. Solving problems elegantly and creatively: “find a way or make a way”.Taking accountability for your own success, and the success of others. WHO ARE YOU? Essential:You are able to work effectively with multiple stakeholders to organise requirements and prioritiesYou are able to learn use of new operational SaaS tools quickly and effectivelyYou have a track record of managing projects and initiatives focussed on efficiencyYou think creatively and quickly to solve problems around deliverablesYou have a strong working knowledge of Excel and/or Google Sheets You are able to adapt to changing priorities and adopt new approaches You are highly organised and motivatedYou are a strong communicator with the ability to inspire and motivate othersYou are confident, empathetic and passionate about working with othersYou are deeply committed to improving the way people and systems work You have deep attention to detail, are disciplined and brilliant at active listeningBonus:You have experience and/or qualifications in project managementYou have experience managing SaaS platforms (Coda & Asana preferred) You have experience in agile working methods or a deep desire to learn moreYou have an understanding of data technologies and roles - or be willing to learn moreTEAM REPORTING & STRUCTUREThis role will report into the Product Ops Lead within the Product Operations Team. This team is part of the Global Product Team.DAY TO DAYOur working hours are from 9am-5pm, Monday - Friday. You plan your working day around the best outcomes for success, identifying and prioritising projects against business needs. We have recently moved into a fully remote working model. In-person team days such as workshops, training days and social events are organised for teams to spend time together on an occasional basis.BENEFITSApart from the above, working at Decoded means you’ll get:33 days* leave per year (inclusive of bank holidays) and extra tenured holiday enabling team members to gain an additional day for every year you are with us (after the first 2 years) up to a maximum of 8. We also close the office for 2 full weeks at Christmas at Decoded's discretion which does not come out of your holiday allowance.Flexible working, including work-from-homeModern, flexible and fully serviced offices at WeWork in Spitalfields, LondonPrivate health care including dental, GP and hospital cover and a gym-discount to help you prioritise your wellbeingTravel insuranceSocial events and all company gatheringsContinuous learning and development. You will be challenged with lots of responsibility and exciting projects in an environment that encourages learningFree monthly lunchesLaptop and virtual work equipment kit providedSalary band £35,000 - £40,000Decoded is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment. We welcome applications from everyone, regardless of their ethnicity, gender, transgender, age, disability, sexual orientation or religion."},{"id":317,"posted_on":"2024-11-29","company":"bunny.net","company_logo":"https://remotive.com/job/1953400/logo","position":"QA Engineer","category":"QA","tags":"{api,backend,C,C#,javascript,python,UI/UX,video,AI/ML,agile,automation,CI/CD,\"Typescript \",SDLC,scripting,testing,diversity,insurance,\"mental health\"}","salary":"above-average industry salaries","location":"UK","apply_url":"https://remotive.com/remote-jobs/qa/qa-engineer-1953400","description":"bunny.net is where individual imaginations gather together to solve next-generation internet challenges. Join a team of experts and, together, help shape the future of the internet. Here, you'll do more than join something — you'll add something.We're not just saying that, but our culture really hops. We have established values that enable our fluffle to grow stronger with each new team member who joins us: Relentless Innovation. Integrity. Impact. Kindness. Diversity. Transparency & open communication. We also believe \"good\" is not good enough, and we continue striving to keep pushing things to the next level by learning and improving every single day. Oh, and did we mention that all our positions are 100% remote with a flexible working schedule? There's no need to relocate if you would like to join us, and you can carve out your own work schedule as well!QA Engineer - BackendWe are seeking a talented QA Engineer to join our Backend team at bunny.net . You will play a pivotal role in ensuring the quality and reliability of our globally distributed, high-performing video streaming and encoding platform. As a QA Engineer, you will be responsible for designing and executing comprehensive test plans, automating testing processes, and validating our platform's performance—with a particular focus on video streaming protocols, encoding standards, and content delivery. At bunny.net , you won’t just join something—you’ll add something significant, contributing to the evolution of our platform and the internet itself.What will you do?\n\nDesign and Implement Test Plans: Develop and execute detailed test plans that cover all aspects of our Stream and Edge Scripting services, ensuring high-quality, reliable releases.\n\nAutomation Framework Development: Build and maintain automation testing frameworks specifically tailored for streaming and edge scripting environments, integrating them into the SDLC.\n\nEnd-to-End Testing: Perform end-to-end testing of streaming workflows, media subsystems (encoding, storage, ingestion, and delivery), and edge scripts to ensure they function flawlessly under various scenarios and loads.\n\nAPI and Scripting Validation: Validate APIs and edge scripts, ensuring they perform correctly and securely across different edge locations.\n\nAI Component Integration Testing: Test the integration and optimization of AI components within the streaming and edge scripting services.\n\nContinuous Integration: Integrate automated tests into CI/CD pipelines, ensuring that new code deployments do not introduce regressions or performance issues.\n\nCollaborate Across Teams: Work closely with developers, product managers, and other QA engineers to identify potential risks and create comprehensive test strategies.\n\nDefect Management: Identify, document, and manage defects, ensuring they are resolved before they impact end users.\n\nPerformance Testing: Conduct performance testing of streaming services and edge scripts, ensuring they can handle high traffic volumes and deliver low-latency experiences.\nWhat will you add?\n\nQA Experience: 3+ years of experience as a QA Engineer, with a strong focus on testing streaming services, edge computing, or similar technologies.\n\nAutomation Expertise: Proficiency in building and maintaining automation test suites, particularly in environments that involve streaming and edge computing.\n\nScripting and Automation: Proficiency in one of the following languages: TypeScript, Python, C#, or related, to create and manage automated tests.\n\nAPI Testing Proficiency: Extensive experience in API testing using frameworks such as RestAssured, Playwright, and Soap UI.\n\nMedia Streaming Knowledge: Understanding on how to test media streaming and encoding.\n\nCI/CD Integration: Experience integrating testing processes into CI/CD pipelines, facilitating continuous deployment and rapid iteration.\n\nScripting and Coding: Proficiency in scripting languages (e.g., Python, JavaScript) to create and manage automated tests.\n\nAgile Environment Experience: Familiarity with Agile methodologies, with experience contributing to fast-paced, iterative development cycles.\n\nPerformance Testing Proficiency: Experience with performance testing tools and techniques, ensuring that streaming services and edge scripts maintain optimal performance under load.\nWhat is in it for you?At bunny.net, we invest in you. We want to provide significant benefits while also helping you maintain a healthy work & personal life.\n\nA competitive salary. You can expect above-average industry salaries.\n\n100% flexible working hours. Work from anywhere, at your own schedule. \n\nMedical, dental, and vision insurance covers you all over the world.\n\nPaid Time Off. Love visiting the seaside? No problem - us, too. We offer 25 days of paid vacation (plus your local public holidays on top).\n\nParental Leave. Bonding with the little ones is super important, so we offer parental leave and flexible scheduling to ease your way into parenthood.\n\nHome Office Budget. We believe everyone is more efficient working in a comfortable office, and we're happy to help.\n\nPaid Sick Leave. Feeling ill? Take time off and get back to 100% without worrying about your finances.\n\nMental Health Support. Feeling down? We've got your back. bunny.net provides mental health resources and help via our external partner.\n\nEducational Budget. Dedicated yearly learning and educational budget for books, seminars, and online courses.\n\nWellbeing Budget: A yearly budget to invest in your personal health and wellness.\n\n"},{"id":318,"posted_on":"2024-11-29","company":"OpenZeppelin","company_logo":"https://remotive.com/job/1953343/logo","position":"Senior Product Manager, Operate Tools","category":"Product","tags":"{\"product management\"}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/product/senior-product-manager-operate-tools-1953343","description":"About us\nFounded in 2015 with the mission to protect the open economy, OpenZeppelin is the world leader in securing blockchain applications and smart contracts. \nIts bedrock open source Contract Libraries are a public good and industry standard for smart contract development. \nOpenZeppelin’s professional expertise, unified with the Defender developer security platform, integrates through clients’ development lifecycles, so teams can plan, code, audit, deploy and operate projects faster and more safely.\nPlease note: Always refer to OpenZeppelin's official job page for the most accurate information about our open roles, as we have seen multiple third party job sites posting inaccurate information.The Product Team ❤️\nOur Product Team is responsible for the strategy, planning, launch, and adoption of the different OpenZeppelin products. This role will be focused on adoption and helping developers thrive using our developer tools for operating onchain applications such as Relayers, Monitors and Access Control. It will require experience and skills in go-to-market, product marketing, and developer relations, as well as product management.\nThe Product Team works closely with all the functions in order to achieve our goal of protecting the open economy by enabling developers and companies to securely code, audit, deploy, and operate smart contracts. We put a strong emphasis on user experience and analytics, and we love to experiment!\nWhat you'll be doing\n\nDefine and execute a clear product roadmap for our Operate Tools that aligns with our vision to scale secure blockchain applications to a broader audience.\nWork closely with Development, Design, Data Team, and other stakeholders to discover and deliver solutions that meet the needs of developers and users alike.\nManage the product backlog, prioritize opportunities based on impact, and oversee the end-to-end execution of product initiatives.\nEstablish key performance metrics to guide product decisions and measure success, ensuring that we are delivering value to both developers and the broader ecosystem.\nReport on progress, identify strategic challenges, and refine product strategies in collaboration with leadership.\nEngage with developers and ecosystem partners to understand unmet needs, gather feedback, and identify opportunities for product improvement and innovation.\n\nYou have\n\n5+ years of product management experience with a proven ability to lead cross-functional teams and drive product initiatives from concept to launch.\nStrong understanding of blockchain technologies, particularly Ethereum, and familiarity with the developer tools and communities within the ecosystem.\nAn ownership mindset with the ability to thrive in a fast-paced, remote work environment, taking initiative to drive projects forward.\nTechnical background such as a degree in Engineering or Computer Science.\nStartup experience.\nDeep care in building technical software products. Experience managing such products from conception to launch.\nExcellent organization, execution and project management skills, data driven approach to product decisions.\nExperience writing documentation or producing other content to synthesize technical concepts and communicating them in a clear, simple way.\nOpen Source experience, either working at an open source company, as a creator of an open source project and community or as a contributor to a popular open source project.\nAbility to balance short-term objectives with long-term vision, aligning product developments with overall company goals.\nCommon sense, low ego, empathy, and excellent communication skills.\n\nNice to have\n\nExperience contributing to open-source projects or engaging actively in open-source communities.\nHands-on experience with smart contract development or familiarity with programming languages used in blockchain development.\nParticipation in blockchain events, forums, or other forms of community engagement.\n\n \n\nBenefits\n\nCompany in-person gatherings in different locations around the world 😎\nFully remote work 🌎\nFlexible time off 🏝\nPaid parental leave for primary or second caregiver 💙\nOne time work-from-home equipment stipend of up to $500 USD 🪑\nCo-working (up to $250/month) 👩‍💻\nMedical coverage\nAnnual Learning & Development budget 🧠\nReferral program\nWork with a global team in a fast-growing industry 🚀\n\nAt OpenZeppelin, we are an equal opportunity employer and we value different perspectives. We are committed to building a diverse workforce. This includes but is not limited to gender, race, sexual orientation, religion, national origin and other characteristics that make each one of us unique. In this uniqueness, we find the most value. Come join us!\n \n\n"},{"id":319,"posted_on":"2024-11-29","company":"Delivery Hero","company_logo":"https://remotive.com/job/1953966/logo","position":"Senior Android Engineer","category":"Software Development","tags":"{java,kotlin,\"Android SDK\"}","salary":"","location":"Greece","apply_url":"https://remotive.com/remote-jobs/software-dev/senior-android-engineer-1953966","description":"Company Descriptionefood is the #1 delivery service in Greece, working with more than 21.000 stores in 100 cities. We offer our users the opportunity to order anything they desire, wherever they are, giving them the option to pay by cash or card.efood is much more than a great place to work: it is an entire working experience that has its own set of core values: We care, We deliver solutions, We always aim higher. These values shape a single culture across the organization, guiding the behavior of every efooder and contributing to the successful implementation of the company’s mission.\n\n\nefood is part of the Delivery Hero Group, the world’s leading local delivery platform operating in 70+ countries worldwideJob DescriptionWe are in the unique position to experience new and interesting situations that many companies have never seen before. We bake challenges by using agile methodologies, top line tools and of course always working with the best of teams. This is a chance to be part of a rapidly growing team in a company that is changing the online delivery landscape, and be able to influence, execute and see the impact of your work at the end of the day. We are looking for an experienced and passionate Senior Android Engineer who will provide high quality products that drive our business. We are a team of energetic, motivated and restless tech enthusiasts that take on the challenge of empowering our customers and internal users. We do that by providing them with the necessary intuitive technologies through creating a wide range of software solutions. If these sound like you, then challenge yourself by joining our #techteam and make an impact! What you’ll do:Collaboratively define, design, and deliver new features with iOS, Web and backend engineers, UI/UX designers, and product managers.Ensure software robustness with comprehensive unit and integration testing, addressing edge cases, usability, and general reliability.Initiate and drive personal project initiatives from idea to app integration.Lead projects from inception to successful delivery, aligning with business goals and stakeholder expectations.Keep up with the latest Android SDK, tools and conventions.QualificationsUniversity and/ or Postgraduate Degree in Computer Science, Computer Engineering or equivalent.4+ years of engineering experience with at least 2 years of experience shipping real-world production Android applications.Passion about mobile platforms and solid understanding of the full mobile development life cycle.Excellent knowledge of Kotlin and Java.Experience with one or more of the following architecture design patterns: MVP, MVVM, Clean architecture.Strong knowledge of design principles, patterns, and best practices in application development.Experience in leading medium to large-scale projects.Excellent problem-solving and learning ability.Holistic knowledge and passion for the platform.Proficiency with Jetpack Compose, Room, Kotlin Coroutines, ReactiveX.Superior analytical skills and a strong sense of ownership in your work.Strong communication and collaboration skills. Nice to have:Familiarity with integration/functional/UI Automation testing.Analytic tool experience and data driven culture.Experience in CI tools (Github Actions, Bitrise or similar tools).Additional InformationIf you are happy, we are happy! That’s why we offer an attractive remuneration package for what you bring in!We share a passion for food, so you will certainly appreciate the ticket restaurant card to spend in restaurants and/or food supplies. We are efooders after all!We take care of you with Private Medical & Life Insurance from day #1 to keep you healthy and happy!We prioritize your mental health and offer round-the-clock access to an online mental health platform. You can schedule unlimited therapy sessions with certified psychologists and coaching sessions with experienced coaches.We want you to grow with us! And to help you keep improving, we provide you access to our online training platform where you can study topics for your personal and professional growth!Are you a cappuccino lover ? Do you desperately want a cookie? Our cafeteria got you covered!If you want to stay in shape , our in-house gym awaits you fully equipped!We are passionate about exploring, growing & learning and our Global Mobility plan is created to help our people find their purpose  around the world ! Life @efood:At efood, no day is the same as the day before!efooders know that working and having a good time aren't the opposite and that’s why every day at efood is a new adventure!We always aim higher and we thrive in finding solutions to push our limits further! We care about our customers, our employees, and our society.We seize every opportunity to celebrate achievements and milestones, but we also celebrate small things (like Fridays!)Every efooder is part of a fast-growing multinational company, with endless opportunities for professional growth and acquisition of new skills! We have an established, yet super creative and fun working environment, with talented and ambitious people whose ultimate goal is to maintain efood as the ideal workplace!Hungry enough to join us?efood collects and processes personal data in accordance with applicable data protection laws. If you are a European Job Applicant see the privacy notice for further details.efood collects and processes personal data in accordance with applicable data protection laws. If you are a European Job Applicant see the privacy notice for further details."},{"id":320,"posted_on":"2024-11-29","company":"Paired","company_logo":"https://remotive.com/job/1953407/logo","position":"Freelance Senior In-App Content Editor","category":"Writing","tags":"{editing}","salary":"£350 - £400 per day","location":"UK","apply_url":"https://remotive.com/remote-jobs/writing/freelance-senior-in-app-content-editor-1953407","description":"About PairedAt Paired, we’re on a mission to help couples stay in love. So we created a fun, safe, and award-winning app for couples who are already in love to explore their relationship, get to know one another in new ways, and ultimately grow together.Our expert-backed questions, games and quizzes are designed to improve key relationship skills in just a few minutes each day. Because we know: The journey of love evolves beyond the initial spark - with beautiful moments but also a lot of challenges.Work Setup And Compensation Freelance: Fully remote, reporting to our Content Lead Tamsin Schedule: 3 days per week  Rate: £350 - £400 per day  Contract length: Immediately to August 31, 2025 About The RoleWe’re seeking a freelance content writer and editor to create engaging and research-backed relationship content for the Paired app that brings couples closer together.You’ll work closely with our in-house editorial team, product managers, and creative marketing team to build content our couples love, trust and rely on.What The Role Encompasses Research, write and edit engaging relationship content (questions, quizzes, games, and exercises) that brings couples closer together Deliver engaging in-app content that is fact-checked, accurate, and inclusive, with minimal revisions required Use content management systems to upload and QA content and schedule ahead of time Work with relationship experts (in-house and external) on long-form content and key projects Review AI-generated content for quality and editorial excellence Requirements5+ years of professional working experience in an editorial role Experience in writing, commissioning, and editing content on topics such as relationships, intimacy and sex, health, wellness, well-being, and lifestyle Experience working for market-leading digital health or lifestyle apps/platforms is a huge advantage Fluency in English, along with impeccable grammar, spelling, and editorial skills Proficient in using content management systems Ability to produce excellent copy with attention to detail under tight deadlines Adaptability and a proactive approach to receiving and sharing feedback on editorial content Strong interest in relationship science and a genuine enthusiasm for creating content related to relationships, intimacy, and sexuality Strong collaboration skills and ability to work with a range of stakeholders You are a resident of the UK, legally entitled to work as a freelancer, and comfortable with remote work Hiring process Application review (qualifications, experience, and motivation) Initial call to talk about your background and the role Task - We’ll send you a task to complete at home to assess your practical skills Team Interviews - The final step involves 2 interviews with Content and Product team members Offer Diversity & Inclusion at Paired Our core value is championing relationships. Our app was built to serve all couples regardless of culture, gender, sexual orientation, and ethnicity We strive to create an inclusive environment where unique perspectives are encouraged, as we firmly believe that diversity enhances our company, culture and product We regularly review our hiring processes, materials and pipeline to ensure they are accessible and free of bias, offering equal opportunity to underrepresented groups. We are also always learning. We maintain open minds and welcome feedback on how we can improve, no matter where it comes from About the companyWelcome 👋At Paired, we’re on a mission to help couples stay in love. After the rush of falling in love fades and partners enter the more committed stage, even the most loving couples will inevitably hit challenges.So we created a fun, safe space for couples who are already in love to explore their relationship, get to know one another in new ways, and ultimately grow together.Our expert-backed questions, games and quizzes are designed to improve key relationship skills in just a few minutes each day. Together, you and your partner can learn how to communicate better, manage conflict, and feel connected on a deeper level."},{"id":321,"posted_on":"2024-11-29","company":"SeatGeek","company_logo":"https://remotive.com/job/1953123/logo","position":"Head of Total Rewards","category":"Human Resources","tags":"{\"people management\"}","salary":"$167,000 - $283,000","location":"USA","apply_url":"https://remotive.com/remote-jobs/hr/head-of-total-rewards-1953123","description":"SeatGeek believes live events are powerful experiences that unite humans. With our technological savvy and fan-first attitude we’re simplifying and modernizing the ticketing industry. \nAs the leader of our Total Rewards program, the proverbial buck will stop with you. You will own the evaluation, continuous improvement, and implementation of our compensation, payroll, mobility, and benefits programming globally. At SeatGeek we believe our people are an essential strategic advantage; our compensation team is of great importance to ensure the team is motivated and rewarded appropriately.\nWhat you'll do\n\nTranslate our compensation and benefits philosophy into a tactical execution plan for employees with a focus on our annual equity refresh program and salary reviews\nPartner with Finance to forecast and lead multi-year financial models including annual merit, promotion, and equity budgets\nBuild our total rewards employee value proposition; driving employee communications to inform various reward values across offerings (cash, equity, benefits, perks, etc.) to attract, retain, and engage fellow Geeks \nManage, coach, and develop a team of compensation and benefits experts\nCollaborate and consult with HR Business Partners and Recruiting on offers, promotions, transfers, and develop policies and guidelines \nForecast and propose a long-term compensation and equity strategy roadmap that is competitive in the marketplace while keeping in mind the equity pool\nIterate upon our current compensation model while working with our executive team – particularly our CFO and CEO – and board to build a truly innovative total rewards and equity program\nDevelop the annual calendar of core activities and lead the preparation of materials for the Compensation Committee\n\nWhat you have\n\n10+ years working in tech company total rewards (compensation and benefits) or management consulting \n3+ years of people management experience\nProven ability to innovate in the rewards space and develop success metrics\nExtensive knowledge of quantitative and qualitative research methods\nSheets/Excel wizardry - vlookups, index matches, etc. with a penchant for data visualization \nA love of numbers and data, with an open-minded approach to problem solving\nComfort working in an agile work environment; you’re quick on your feet\nAssertion when required; you’re able to challenge and be challenged both internally and with clients in a constructive and respectful way\nStrong problem solving skills; you’re able to quickly digest a problem and evaluate solutions and then empower others to deliver\nAbility to make effective decisions under pressure and promote a calm and considered approach\nA desire to consistently improve efficiency and quality of delivery\nExcellent time management skills and written and verbal communication skills\n\nPerks\n\nEquity stake\nFlexible work environment, allowing you to work as many days a week in the office as you’d like or 100% remotely\nA WFH stipend to support your home office setup\nUnlimited PTO\nUp to 16 weeks of paid family leave\n401(k) matching program\nHealth, vision, dental, and life insurance\nUp to $25k towards family building services\n$500 per year for wellness expenses\nSubscriptions to Headspace (meditation), Headspace Care (therapy), and One Medical\n$120 per month to spend on tickets to live events\nAnnual subscription to Spotify, Apple Music, or Amazon music\n\n \n\nThe salary range for this role is $167,000 - $283,000. Actual compensation packages within that range are based on a wide array of factors unique to each candidate, including but not limited to skill set, years and depth of experience, certifications, and specific location.\nSeatGeek is committed to providing equal employment opportunities to all employees and applicants for employment regardless of race, color, religion, creed, age, national origin or ancestry, ethnicity, sex, sexual orientation, gender identity or expression, disability, military or veteran status, or any other category protected by federal, state, or local law. As an equal opportunities employer, we recognize that diversity is a positive attribute and we welcome the differences and benefits that a diverse culture brings. Come join us!\nTo review our candidate privacy notice, click here.\n#LI-Remote"},{"id":322,"posted_on":"2024-11-29","company":"native","company_logo":"https://remotive.com/job/1953369/logo","position":"Junior DevOps Engineer","category":"DevOps / Sysadmin","tags":"{AWS,kubernetes,python,terraform}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/devops/junior-devops-engineer-1953369","description":"Native is a next-generation liquidity infrastructure that transforms traditional inventory-based trading with a credit-driven model. Powered by our Credit Margin Engine, Native ensures liquidity is available precisely when and where it’s needed, all through a single API. This creates a frictionless experience for DeFi participants, while seamlessly abstracting chain complexities for any ecosystem or dApp.\n \nPosition Summary\nNative is seeking a motivated DevOps Engineer with 1-2 years of DevOps experience and 3-4 years in IT/infrastructure to join our dynamic team. The ideal candidate is a collaborative team player who excels in a fast-paced environment and is passionate about building and maintaining scalable infrastructure.\n \nJob Responsibilities\n\nCollaboration: Work closely with development teams and various stakeholders to ensure seamless integration and deployment processes.\nTroubleshooting: Perform deep-dive analysis to identify and resolve infrastructure and application issues at their root cause.\nObservability: Implement and manage monitoring and logging solutions using tools like Grafana, Loki, and Prometheus to ensure system reliability and performance.\nContainer Management: Administer and maintain Kubernetes clusters, ensuring their stability, security, and scalability. Utilize tools like Kustomize for configuration management and optimize cluster performance.\nCloud Services: Utilize AWS or other major cloud platforms to design, deploy, and maintain scalable infrastructure.\nInfrastructure as Code: Develop and maintain infrastructure using Terraform and Ansible, and manage deployments with ArgoCD/GitOps practices.\nAutomation & Scripting: Write and maintain scripts in Bash or Python to automate routine tasks and improve system efficiency.\nCI/CD Pipelines: Assist in the development and maintenance of continuous integration and continuous deployment pipelines to streamline software delivery.\n\n \nJob Requirements\nExperience:\n\n\n\n\n\n\n1-2 years of DevOps experience\n\n\n3-4 years of total experience in IT or infrastructure roles\n\n\n\n\n\n\nTechnical Skills:\n\n\n\n\n\n\nProficiency with observability tools: Grafana, Loki, Prometheus\n\n\nHands-on experience with Kubernetes, Kustomize and Helm\n\n\nExperience with AWS or other major cloud platforms\n\n\nKnowledge of Terraform and Ansible\n\n\nExperience with ArgoCD / GitOps is a plus.\n\n\nProficient in scripting languages such as Bash and Python\n\n\n\n\n\n\nSoft Skills:\n\n\n\n\n\n\nStrong team player with excellent collaboration and communication skills\n\n\nAbility to troubleshoot complex issues and perform root cause analysis\n\n\nAdaptable and eager to learn new technologies and methodologies\n\n\n\n\n\n\nPreferred Qualifications:\n\n\n\n\n\n\n\n\nCertifications: Certified Kubernetes Administrator (CKA) is a significant advantage.\n\n\nAdditional Skills:\n\n\nExperience with Docker and containerization technologies.\n\n\nFamiliarity with version control systems, especially Git.\n\n\nUnderstanding of security best practices in infrastructure and deployment.\n\n\nExperience with CI/CD tools like Jenkins, GitLab CI, or similar.\n\n\n\n\n\n\n\n\n\n"},{"id":323,"posted_on":"2024-11-29","company":"Casebook PBC","company_logo":"https://remotive.com/job/1953764/logo","position":"Sr. SDR - Sales Development Representative","category":"Sales / Business","tags":"{\"sales development\"}","salary":"$60-$75k base + commissions + benefits + 401k","location":"USA, Canada","apply_url":"https://remotive.com/remote-jobs/sales-business/sr-sdr-sales-development-representative-1953764","description":"Company DescriptionAt Casebook PBC, our software makes people’s lives better. Our company is committed to empowering community well-being through the delivery of adaptive, research-based and practice-driven technology. Designed to help the helpers, our innovative and award-winning SaaS solutions help improve outcomes in human services.Job DescriptionThe Sales Development Representative is typically the first person a prospective customer will interact with as part of the sales process. Casebook’s Sales Development organization is responsible for outbound prospecting with a focus on nonprofit and local government organizations. This position plays a vital role in driving Casebook’s mission of empowering human services to better serve their communities by expanding access to innovative technology solutions. The SDR III takes a leading role in the organization as both a top achiever and mentor to other SDRs. This position requires high-achieving experience in sales development as well as familiarity with the markets Casebook PBC serves. The Casebook platform supports human services and social services workers engaged in making people’s lives better.  We are looking for individuals who are passionate about leveraging technology to solve human services challenges and can clearly articulate how Casebook can address the needs of our customers.  Our ideal candidate has a strong sense of mission and is dedicated to providing exceptional customer experiences, therefore, empowering our clients to achieve impactful outcomes. ResponsibilitiesIdentify and make outreach to organizations in the US and Canada that meet Casebook’s ideal customer profileUse a data-driven approach to prioritize and engage prospects, leveraging account-based sales strategies to develop and execute a prospecting plan that supports the company’s annual lead generation goals and targets high-value organizations.Collaborate with Marketing, RevOps, Customer Success and other teams to maximize lead generation potentialContribute to building a 3x pipeline in order to achieve annual team revenue goalsCustomize outreach messaging to resonate with nonprofits and government stakeholders, focusing on their unique challenges in human services.Use tools like Hubspot, ZoomInfo, and LinkedIn Sales Navigator to identify and connect with prospective customersTravel approximately 6x per year for conferences, team meetings, or company-wide offsitesQualifications At least two years of outbound sales development/business development experience with a strong track record to meet or exceed outbound activity and pipeline generation targets, with specific examples of past quota attainment.Nonprofit or Government sales experience (experience working in human services at a nonprofit organization or government agency is also acceptable)Ability to manage time effectively while working from a home/remote officeMust work well as part of a team MUST have access to a connection fast enough for video and VoIP calls – (25mbps+)Ability to travel occasionally (10%)Experience working in a CRM such as HubspotAllowed to work in the USPlease include details of past quota attainment when applyingComp Range for the position is $60-$75k USD base salary + Commissions + Benefits + 401kAdditional InformationIn addition to salary and sales commission, this position includes a full benefits package including employer funded health insurance for you and a spouse, 401k, and three weeks vacation time. "},{"id":324,"posted_on":"2024-11-29","company":"Prolific","company_logo":"https://remotive.com/job/1954085/logo","position":"Software Engineer","category":"Software Development","tags":"{javascript,python}","salary":"£67,000-75,000 + share options","location":"UK","apply_url":"https://remotive.com/remote-jobs/software-dev/software-engineer-1954085","description":"Software Engineer \nEngineering\n[£67,000-75,000 + Share Options]\n                    \n  Prolific\nProlific is not just another player in the AI space – we are the architects of the human data infrastructure that's reshaping the landscape of AI development. In a world where foundational AI technologies are increasingly commoditized, it's the quality and diversity of human-generated data that truly differentiates products and models.\n \nThe role\nWe’re looking for Software Engineers with a ‘product builder’ mind-set to join our team and take a pivotal role in the development and guidance of our product. As a ‘T-shaped’ engineer, you will bring a broad practical knowledge across various areas of software development, complementing and supporting our growing team whilst having a deeper specialism in backend. This is an exciting opportunity to leverage your existing skills, experience, and knowledge to significantly influence the trajectory of our product as we aim to revolutionize research.\nThis team is responsible for designing, building, and maintaining a world-class enterprise payment platform that supports the ever-evolving needs of our rapidly growing business. Our mission is to create seamless, scalable, and reliable solutions that enable secure and efficient transactions at a massive scale!\nWhat you’ll be doing in the role \n\nTeam Collaboration: Work as part of a cross-functional, stream-aligned team, collaborating with the engineering manager, product manager, designer, tech lead, and fellow engineers.\nAgile Practices: Use agile software development and a product mindset to plan, build, and support software that delivers value to customers.\nCustomer Focus: Partner with teams outside of product engineering and work closely with customers to understand their needs.\nCloud Expertise: Confidently work across major cloud providers, including AWS, GCP, and Azure.\nOwnership & Operations: Embrace a 'You Build It, You Run It' mindset, maintaining ownership from code commit to production while striving for system stability and observability.\nGrowth Mindset: Champion engineering principles and actively improve the engineering culture.\nProactive Attitude: Self-motivated and energetic, thriving in a fast-paced environment with a bias for action.\n\n \nWhat you’ll bring to the role\n\nTechnical Expertise: Proficient in Python (or similar), TypeScript/JavaScript, and NoSQL Databases. Event-Driven Architectures, AWS (Serverless) and /orGCP.\nQuality & Observability: Strong advocate for test automation and maintaining high-quality code. Experience supporting production systems with a focus on observability (e.g., RUM, tracing).\nCollaboration & Mentorship: Skilled in working within teams with strong engineering practices, sharing knowledge, and fostering collective excellence.\nCustomer & Product Focus: Committed to delivering customer-centric solutions and caring about the entire product lifecycle.\nContinuous Improvement: Passionate about iterative development, using data and feedback to drive enhancements in processes and outcomes.\nLearning & Adaptability: Dedicated to self-improvement and staying current with the latest trends in software development.\nAdvantageous: Experience building billing or payment platforms.\n\n \nKey Technologies \n\nCloud Platforms: Google Cloud Platform and AWS\nProgramming Languages: Python, JavaScript, and TypeScript\nFrameworks: Vue.js, Django Rest Framework, Container-based and Serverless architectures\nDatabases: MongoDB and DynamoDB\nDevOps and Monitoring: CircleCI, GitHub Actions, Kubernetes, Celery, EventBridge and DataDog\n\n \nWhy Prolific is a great place to work\nWe've built a unique platform that connects researchers and companies with a global pool of participants, enabling the collection of high-quality, ethically sourced human behavioral data and feedback. This data is the cornerstone of developing more accurate, nuanced, and aligned AI systems.\nWe believe that the next leap in AI capabilities won't come solely from scaling existing models, but from integrating diverse human perspectives and behaviors into AI development. By providing this crucial human data infrastructure, Prolific is positioning itself at the forefront of the next wave of AI innovation – one that reflects the breath and the best of humanity.\nWorking for us will place you at the forefront of AI innovation, providing access to our unique human data platform and opportunities for groundbreaking research. Join us to enjoy a competitive salary, benefits, and remote working within our impactful, mission-driven culture.\n \nLinks to more information on Prolific\nBenefits \nExternal Handbook \nWebsite \nYoutube \n \nPrivacy Statement\nBy submitting your application, you agree that Prolific may collect your personal data for recruiting and global organisation planning. Prolific's Candidate Privacy Notice explains what personal information Prolific may process, where Prolific may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Prolific use of your personal information."},{"id":325,"posted_on":"2024-11-29","company":"Syteca","company_logo":"https://remotive.com/job/1953891/logo","position":"Partner Marketing Manager","category":"Marketing","tags":"{\"digital marketing\",\"business development\"}","salary":"","location":"Ukraine","apply_url":"https://remotive.com/remote-jobs/marketing/partner-marketing-manager-1953891","description":"Syteca Inc. is a recognized software vendor delivering a cybersecurity platform dedicated to inside perimeter security. The Syteca platform provides advanced user activity monitoring (UAM) and robust privileged access management (PAM) solutions to organizations in every industry and sector.\nFounded as Ekran System in 2013 by a team of passionate cybersecurity experts, Syteca Inc. has grown into a global cybersecurity provider for more than 1,500 organizations across every industry on every continent. With headquarters in Needham, MA, USA, and a worldwide network of offices and partners, we're dedicated to safeguarding organizations of all sizes from human-related risks.\nWe are looking for a versatile and high-energy Partner Marketing Manager to drive the strategy, development, and implementation of campaign marketing efforts with our top Global Partners and always-on motions to scale.\nRequirements\n-2+ years combined experience in marketing, sales, business development, and/or consulting services\n-English level: Advanced\n-Event management experience (internal and external)\n-Practical knowledge of working with various digital marketing channels: SEO|SEM, PPC, Email, Social and Online Media, Video, Content\n-Hands-on experience in content management & content creation\n-Excellent oral and written communication skills and the ability to persuasively articulate company offerings and their business value to partners\n-Excellent problem-solving and negotiation & collaboration skills\n-Comfort in presenting at the leadership level\n-Proactiveness, ability to multitask\n-A strategic thinker, with strong analytical skills with the ability to draw key insights from data to make key marketing decisions. Tactical, hands-on experience with all parts of the outbound and inbound marketing process.\nResponsibilities:\n-Build strong and trusted relationships with Syteca's partners\n-Increase Syteca's brand awareness within partner ecosystem through marketing campaigns, partner events and relations with account managers\n-Maintain and expand relationships with strategic alliance executives and seeks to expand market penetration in the partner ecosystem\n-Promote technical and enablement opportunities with our alliances to support strategic growth objectives\n-Work closely with Sales, Product and Support Departments \n-Own operational goals and tasks to ensure targets are reached, data and reporting are up to date and accurate both in partner systems and Syteca's internal reporting\n-Develop partner engagement activities such as marketing campaigns, alignment and customer engagement\n-Support other units within Syteca's in developing any GTM strategy aligned to partners\n-Establishing performance standards, scorecards and data gathering required to evaluate and manage the performance\nOur benefits:\n-Work with well-known cybersecurity product  \n-High-level partners around the world \n-Team of the experts and continual exchange of experience \n-Flexible work hours, and working remotely \n-Paid 20 working days of annual leave and sick leave \n-Medical insurance / compensation for sports \n-Mental health support and other corporate bonuses \n-Necessary equipment provided (laptop, accessories) \n-Career development and professional growth \n-Self-realization and implementation of new ideas \nIf you are interested in this position, please send us your detailed CV.\n"},{"id":326,"posted_on":"2024-11-29","company":"Distribusion Technologies","company_logo":"https://remotive.com/job/1953553/logo","position":"Integrations System Analyst","category":"All others","tags":"{api}","salary":"","location":"Europe","apply_url":"https://remotive.com/remote-jobs/all-others/integrations-system-analyst-1953553","description":"Distribusion is the world’s leading ground transportation marketplace and gives travelers seamless access to ground transportation online, from search to ticket purchase. We have built a cutting-edge B2B technology platform that connects bus, rail, and ferry operators in 70+ countries with the biggest online retailers, including Google Maps and Booking.com.We are shaping the future of travel and building the largest global network of transport providers and retailers. We are one of the fastest growing startups in travel, backed by two leading VCs (TQ Ventures & Lightrock), and now, following our recent $80m Series C funding, we are ready to push beyond.We are looking for a Integrations System Analyst to join our Supply domain, more specifically in the Integrations team, which is responsible for onboarding carriers onto our system (integrating external systems, harmonizing data structures and building revenue-increasing products for carriers). This is key to scale our business, therefore our focus is on innovation and automation.What you will do:Extend functionalities to enable new opportunities.Automate and innovate our existing inventory (our API product is already used by big players).Own scoping and management of onboarding new carriers.Take a lead role in defining and challenging strategic decisions.Contribute to the team with process improvements (e.g. Jira, reporting etc.).Build relationships with key stakeholders (internal/external – C-level).Prioritize the roadmap effectively.Guide more junior colleagues in delivering the right products.Workplace:We are ideally looking for this role to be based in the Berlin HQ, but we can consider candidates in Europe or willing to relocate within Europe as well. We are a remote-first company with teams located around the Globe.Who you are:5+ years or more of professional experience in technical projects.Hands-on experience with the technical side of the product (API / Data products).Strong stakeholder experience within with ability to influence without direct authority (including C-level executives).Good at context switching whilst showing proactivity and ownership across your responsibilities.Experience working with complex products (advantage).Good management skills (product, process, project, people management).Experience working within cross-functional teams.Technical degree or Bachelor’s degree in Computer Science, Engineering or related studies.Fluent in English, both verbal and written.Fluent in Spanish (nice to have)Leadership experience (nice to have)Transportation industry standards (nice to have)What you can expect:You will join a fast-paced travel tech company and take on a rapidly growing industry.You will take on ownership and responsibility from day one and have a direct impact on the success of the company.We value agility! We’re constantly updating our tech stack and offer the best possible tools to ensure all of our in-house engineers, partners, and carriers benefit from cutting-edge, efficient solutions.You will work with global companies. Our product attracts the biggest names in travel technology, such as Booking.com and Google Maps, and national carriers like Amtrak, Deutsche Bahn, Renfe, and SNCF.You will join an international team of talented and driven people with a clear mission. Expect your colleagues to inspire, support and challenge you every day!We offer flexible and remote working conditions, relocation opportunities and career growth in a small and developing company.Our hiring process for this role:Your Talent Partner (TP) and point of contact is Masha Marynova, and the Hiring Manager (HM) is Jorien Knipping. For any questions, you can contact us at (talent@distribusion.com).Do you want to work on a product that is used by millions of people daily with a high load, availability and scalability, and most advanced technology? Come join us!"},{"id":327,"posted_on":"2024-11-29","company":"Keywords Studios","company_logo":"https://remotive.com/job/1953539/logo","position":"Senior Financial Analyst","category":"Finance / Legal","tags":"{excel}","salary":"starting at $50000 mxn/month","location":"Mexico","apply_url":"https://remotive.com/remote-jobs/finance-legal/senior-financial-analyst-1953539","description":"Join Keywords Studios, the world's leading provider of technical and creative services to the global video game as a Senior Financial Analyst, you will play a crucial role in ensuring accurate and timely processing of payments and maintaining solid relationships with our vendors.\nResponsibilities include data analysis, recording journal-entries, reconciling accounts, maintaining accurate financial records, preparing monthly variance analysis and participating in month-end closing activities.\nKeywords Studios offers a supportive and collaborative culture where you will have the opportunity to learn and grow. We empower our employees to perform to the best of their ability and provide various training opportunities to further develop your skills. If you have a passion for finance and the video games industry, join us at Keywords Studios and be a part of our \"can do\" attitude.\n \nPosition Summary: \nWe are seeking a dependable Senior Financial Analyst to support the preparation of financial statements in compliance with all regulatory and accounting standards under the guidance of a Controller. The ideal candidate for this role should be an effective communicator with the Regional Finance Team and possess a strong grasp of Local GAAP and IFRS. They must be a highly organized professional with acute attention to detail, demonstrating the ability to work both autonomously and collaboratively. The Financial Analyst will be responsible for identifying and preventing discrepancies and implementing control systems to enhance daily operations. The primary objective of this position is to ensure the company's accounting and financial processes meet the highest standards, delivering accurate financial reporting and control. \n \nJob Responsibilities: \nPlease note that this list represents the primary responsibilities of the role and is not exhaustive.  \n\nMaintain a comprehensive understanding of accounting principles, including the management of various foreign currencies. \nPrepare, monitor, and consolidate budgets, offering detailed explanations for variations against actual results. \nPrepare, monitor, and consolidate forecasts, providing clear explanations for variations against actual results. \nExecute intercompany reconciliations. \nPossess general knowledge of taxes, including calculations for provisional and annual payments, deferred tax, and VAT refunds. \nPrepare DIOT and electronic accounting documents. \nGenerate reports for auditors. \nContinuously monitor existing processes and maximize automation where possible. \nEstablish necessary processes based on daily operations. \nSupport various aspects of accounting management, including billing, taxes, accounts receivable, accounts payable, general accounting, and reporting. \nAssist in establishing internal controls and policies to ensure compliance with regulations and industry best practices. \nParticipate in the preparation of financial statements, adhering to official guidelines and internal requirements. \n\n\nManage journal entries, invoices, and account reconciliations for monthly or annual closings.\n\nRequirements\n\nStrong oral and written communication skills in English. \nExcellent knowledge of accounting and financial processes, including budgeting, monthly financial closings, and reporting. \nProficiency in Excel, with experience in VLOOKUP, SUMIF, pivot tables, and related functions. \nUnderstanding of data analysis and forecasting. \nExceptional organizational skills with the ability to prioritize tasks effectively. \nStrong interpersonal and communication skills. \nKeen attention to detail and a proactive problem-solving mindset. \nAnalytical and accountable with a meticulous eye for detail. \nWorks well under pressure, collaborates effectively, and consistently meets deadlines. \nFamiliarity with NetSuite. \nGeneral knowledge of payroll and social security taxes. \n\n \nEducation and Experience: \n\nBachelor's degree in Accounting. \nMinimum of 5+ years of proven experience in a Financial Analyst role. \nExperience working in a multinational company.\n\n\nPrevious experience in the Big 4 accounting firms is considered an asset\n\nBenefits\nMonthly salary starting at $50000 MXN.\nLaw Benefits\nSchedule: From Monday – Friday\nAfter 3 months:\nMajor and minor medical expenses insurance.\nSaving funds.\nGrocery vouchersWhen providing your information in this application, you indicate that you understand we will collect and process your information in accordance with our Applicant Privacy Notice https://www.keywordsstudios.com/en/applicant-privacy-notice.\n \nRole Information: EN\nStudio: Keywords Studios\nLocation: Americas, Mexico\nArea of Work: Finance\nService: Support Services\nEmployment Type: Full Time, Permanent\nWorking Pattern: Remote\n\nAbout the company\n \n\nCOMPANY PROFILE\nEstablished in 1998 and floated on the London Stock Exchange’s AIM in 2013, Keywords(KWS) is the world’s leading provider of technical and creative services to the global video games market. Our 12,000 employees in 70+ Studios in 26 countries provide graphic art asset production, game development, audio, testing, localization and customer support services to most of the leading video game developers and publishers. We have a proven track record of organic and acquisition-led growth and have successfully acquired and integrated 50+ acquisitions since 2014.\n \nWHY WORK AT KEYWORDS STUDIOS?\nPeople who work at Keywords are passionate, talented, committed and resourceful. As a business we thrive on diversity, celebrate uniqueness and work as teams whether we are physically together in one of our 70 global studios or working together virtually.\nWe empower people to perform to the best of their ability with our “can do” attitude. We appreciate and embrace flexibility. We learn at every opportunity to grow ourselves through experience, training and tackling new challenges.\nThis is what makes us Keywordians.\nhttps://www.keywordsstudios.com/\n"},{"id":328,"posted_on":"2024-11-29","company":"Shift Markets","company_logo":"https://remotive.com/job/1953646/logo","position":"General Ledger Accountant","category":"Finance / Legal","tags":"{bookkeeping}","salary":"","location":"Canada, Brazil, Argentina, Mexico, Panama","apply_url":"https://remotive.com/remote-jobs/finance-legal/general-ledger-accountant-1953646","description":" \nAn opportunity has developed with our partner entity for an enthusiastic Accountant to manage the Company’s accounting records, assist with closing procedures and financial statements and interface with the external CPA firm.  The person in this role will be a vital member of the Accounting team, supporting the company’s continued growth and success by maintaining accurate records of the company’s day-to-day financial transactions and performing routine accounting tasks.  The ideal candidate is a CPA with bookkeeping experience, who thrives in a fast-paced, dynamic environment.  Experience in the crypto space is preferred.\n \nResponsibilities:\n\nMaintain accurate books\nRecord daily financial entries and reconciliations\nWork with general ledger entries\nMaintain income statement, balance sheet, and cash flow statement\nComplete monthly close of financial statements\nDiscuss and present financial statements for internal team and for executives\nManage invoices and tax payments\nRecord payments and adjustments\n\n \nRequirements\n \n\nProficiency in QuickBooks Online\nOutstanding communication skills\nDetail-oriented and well-organized filing of documentation and support\nAccurate and efficient\nAnalytical and critical thinker\nExcellent data analysis skills\nStrong presentation skills\nAdvanced proficiency in Microsoft Office (notably Microsoft Excel), Google Suite apps and other web-based tools\nExperience working in a remote setting, preferred\nCPA license preferred\nBookkeeping experience and experience with cryptocurrency preferred\n\n\nAbout the company\n \nFounded in 2009, Shift Markets began in the traditional finance world, as a leader in the FX space. Sensing the seismic shifts taking place in the financial industry, and the disruptive power of cryptocurrencies and blockchain, we made it our mission to make these decentralized trends accessible to every business, from market leaders to small retailers.\nOur transition into the crypto, blockchain, and Web 3.0 space has centered on the development and deployment of seamless enterprise and Web 3.0 solutions. By offering implementation and consultation services beyond our product range, we ensure that every business gets the Web 3.0 solutions that fit their needs, and fit snugly within their existing tech stack.\n"},{"id":329,"posted_on":"2024-11-29","company":"Agero","company_logo":"https://remotive.com/job/1953360/logo","position":"Data Analyst","category":"Data Analysis","tags":"{python,sql,\"data visualization\",R}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/data/data-analyst-1953360","description":"About Agero:\nWherever drivers go, we’re leading the way. Agero’s mission is to rethink the vehicle ownership experience through a powerful combination of passionate people and data-driven technology, strengthening our clients’ relationships with their customers. As the #1 B2B, white-label provider of digital driver assistance services, we’re pushing the industry in a new direction, taking manual processes, and redefining them as digital, transparent, and connected. This includes: an industry-leading dispatch management platform powered by Swoop; comprehensive accident management services; knowledgeable consumer affairs and connected vehicle capabilities; and a growing marketplace of services, discounts and support enabled by a robust partner ecosystem. The company has over 150 million vehicle coverage points in partnership with leading automobile manufacturers, insurance carriers and many others. Managing one of the largest national networks of service providers, Agero responds to approximately 12 million service events annually. Agero, a member company of The Cross Country Group, is headquartered in Medford, Mass., with operations throughout North America. To learn more, visit https://www.agero.com/.\n\n\n\nPOSITION SUMMARY:\n\n\n\n\nThe Data Analyst plays a critical role in driving data-centric initiatives within the organization, transforming raw data into valuable insights that inform key business strategies. This role involves analyzing complex datasets to uncover trends and patterns, providing actionable insights that help shape business decisions. The Data Analyst works closely with cross-functional teams, including Product and Engineering, to ensure data insights are effectively translated into strategies that improve operational efficiency and foster business growth.\n \nESSENTIAL FUNCTIONS:\n \n\nProduct Analytics & Experimentation:  Optimize decision-making processes across product lifecycle stages. Conduct rigorous A/B testing and experimentation to evaluate product features, user experiences, and pricing strategies. Analyze results to provide actionable insights that inform iterative improvements and drive conversion optimization. Additional focus areas include analyzing product performance metrics, customer segmentation strategies, and market trends to drive informed product development and enhancement strategies.\nPerformance Monitoring: Design and maintain real-time dashboards that monitor key performance indicators (KPIs), conducting in-depth performance analyses to identify trends, anomalies, and areas for improvement. Provide recommendations to support both operational efficiency and strategic initiatives.\nInsight Generation: Leverage quantitative analysis and data storytelling to uncover actionable insights that drive business growth. By deeply understanding marketplace dynamics, customer behaviors, and emerging trends, you will empower business and product leaders to make data-driven decisions. Translate complex data into clear, compelling narratives that inspire innovation and continuous improvement.\nCross-Functional Collaboration: Partner effectively with teams across Product Management, Engineering, Marketing, Sales, and other departments to prioritize and execute data-driven projects.\n\n \n\n\n\n\nJOB SPECIFICATIONS & ROLE BASED COMPETENCIES - KNOWLEDGE, SKILLS AND ABILITIES:\n\n\n\n\nEDUCATION:  Bachelor’s degree in Data Science, Statistics, Computer Science, Mathematics, or a related technical field.\nEXPERIENCE: 2-4 years of experience in data analytics, business analytics, consulting, or related roles. Experience with cloud data platforms such as GBQ, Snowflake, or Redshift. Previous experience in a technical role at a top-tier professional services or leading technology company is preferred.\n \nROLE BASED COMPETENCIES (KNOWLEDGE, SKILLS & ABILITIES): \n\nTechnical Skills: Proficiency in querying, analyzing, and visualizing large datasets using SQL, Python, R, and data visualization tools (e.g., Sigma, Tableau, PowerBI). Strong understanding of statistical techniques (e.g., Regression, A/B Testing, Causal Inference) and their application in business contexts.\nCommunication: Excellent communication and presentation skills, with the ability to convey complex data insights to non-technical stakeholders.\nProblem-Solving: Strong analytical and problem-solving skills, capable of translating business requirements into actionable analytical solutions.\nProject Management: Demonstrated ability in project and task management, attention to detail, and the ability to work independently, as well as part of a team.\n\n \nWORKING RELATIONSHIPS:  This role involves close collaboration with Agero's Product Management team and key stakeholders from Marketing, Engineering, Customer Success, Business, and Finance departments. Additionally, the position requires active engagement with analysts and data scientists across the organization, fostering opportunities to enhance efficiency and cultivate shared technical knowledge and expertise.\n D, E & I Mission & Culture at Agero:\nWe are all Change Drivers at Agero. Each day, we speak to thousands of drivers and tow professionals across one of the most diverse countries in the world. Our mission to safeguard drivers on the road, strengthen our clients’ relationships with their drivers, and support the communities we live and work in unites us together as one force driving positive change.\nThe road to positive change starts inside Agero. In celebrating each other’s differences, we lift each other up and create space for innovation and community. Bringing our whole selves to work powers our commitment, drive, agility, and courage - ensuring we are not only changing the landscape of the driver services industry, we also are making a difference in the lives of our customers with each call, chat, and rescue.\nTHIS DESCRIPTION IS NOT INTENDED TO BE A COMPLETE STATEMENT OF JOB CONTENT, RATHER TO ACT AS A GUIDE TO THE ESSENTIAL FUNCTIONS PERFORMED. MANAGEMENT RETAINS THE DISCRETION TO ADD TO OR CHANGE THE DUTIES OF THE POSITION AT ANY TIME.\nTo review Agero's privacy policy click the link: https://www.agero.com/privacy.\n***Disclaimer: Agero is committed to creating a diverse and inclusive environment and encourages applications from all qualified candidates. Accommodation is available. Additionally, we offer accommodation for applicants with disabilities in our recruitment processes. If you require accommodation during the recruitment process, please contact recruiting@agero.com.\n***Agero communicates with candidates via text for matters related to submitted applications, questions, and availability for interviews. If you prefer not to receive texts, you can contact Agero's recruiting team directly at recruiting@agero.com."},{"id":330,"posted_on":"2024-11-29","company":"Cerba Research","company_logo":"https://remotive.com/job/1953632/logo","position":"Project Manager","category":"Project Management","tags":"{\"project management\",research,mentoring,\"business development\",\"risk management\",\"service delivery\",\"time management\",travel}","salary":"$65.00 - $95,000 per year","location":"USA","apply_url":"https://remotive.com/remote-jobs/project-management/project-manager-1953632","description":"BASED IN THE UNITED STATESAs Project Manager you are the main point of contact for the client post study award and throughout the entire lifecycle (set-up, delivery and closeout) and responsible for leading and driving project execution. Your responsibilities as Project Manager:Initial scope management, project set-up and delivery; operational management, change management and budget management activitiesManage and collaborate with all cross-functional teams toward timely achievement of project related objectivesDevelop and maintain excellent client relationshipsStudy set-up and planning: Manage assigned project / client relationship as assigned, Review study protocol and budget information once study awarded, Initiate internal kick-off meetings to align all key stakeholders on the project objectives and deliverables.Establish a core project team to support project execution throughout the set-up, delivery and closeout stages of the lifecycle, initiate a client kick-off meeting to ensure client stakeholder alignment and agree the scope, strategy and priorities for the projectUnderstand the client needs and ensure solutions are developed to meet the client needs and requirements for the projectDevelop project plans with key milestones, timelines and deliverablesEnsure appropriate planning and forecasting completed with client to ensure appropriate resources are determined to support the projectPartner with the trial set-up manager to ensure accurate set-up and change managementDevelop risk management / mitigation plansEstablish regular client calls to communicate project status updates and resolve project challenges. Coordinate meeting agenda, document minutes, track actions and issues, monitor and maintain project status updates.Monitor site issues and trends and administer relevant training for sites, CROs, Sponsors to ensure project compliance and successful project delivery. Report on core project team performance or service delivery performance (against thecontract, client expectations) to the management team.Manage scope changes and working with contracts and proposals team to implement revised budgets, analyze service issues and implement actions to correct and prevent issues reoccurring, report study progress to internal and external clientsEnsure lessons learned are considered, shared and improvements are in processes. Conduct meetings with internal departments to meet the needs of the study during delivery and closeoutLead problem solving and resolution efforts in a timely and client-focused mannerLead and participate in client facing meetings, travel and present lab services at client meetings, investigator meetings and Business Development meetingsProvide training and mentoring to new hiresYour competences and experience- You have sound planning, time management and organizational skills- You have demonstrated problem solving and decision-making skills- You display effective communication skills in order to work with and communicate with a diverse set of stakeholders - You have good understanding of clinical research principles and process- You are able to prioritize own workload and manage tasks assigned to core project team members- Have the ability to adapt appropriately- With strong presentation and influencing skillsYour background and requirements:- Minimum of 5 years of clinical pharmaceutical industry experience including 2 years of demonstrated skills and competency in clinical project management- University degree (life science or other) or equivalent combination of education and experience- Experience in managing (global) clinical trial programs.- Proven ability to negotiate with clients in a professional manner- Available for domestic and international travel, including overnight stays- Broad knowledge of drug development process and client needsWorking at Cerba ResearchCerba Research is growing fast on a global scale. Working at Cerba Research first of all means that you contribute to improve global health. It also means growing your career in a dynamic, fast paced environment, where you can develop new skills and work on diverse projects. As an equal opportunity employer, Cerba Research is fully devoted to promoting your professional growth and development.By joining us, you will join a diverse, socially active and highly motivated community. Our dynamic workplace emphasizes teamwork, continual learning, and finding fulfillment in your job while providing plenty of opportunity for skill development, participation in a variety of initiatives, and the possibility to take ownership of your role.Interested? Please apply!"},{"id":331,"posted_on":"2024-11-29","company":"Cribl","company_logo":"https://remotive.com/job/1953765/logo","position":"Solutions Engineering Manager","category":"Sales / Business","tags":"{security,CRM,mentoring,\"engineering management\",diversity,travel}","salary":"","location":"UK, Germany, Netherlands","apply_url":"https://remotive.com/remote-jobs/sales-business/solutions-engineering-manager-1953765","description":"\nCribl does differently. \nWhat does that mean? It means we are a serious company that doesn’t take itself too seriously; and we’re looking for people who love to get stuff done, and laugh a bit along the way. We’re growing rapidly - looking for collaborative, curious, and motivated team members who are passionate about putting customers first. As a remote-first company we believe in empowering our employees to do their best work, wherever they are. \nAs the data engine for IT and Security many of the biggest names in the most demanding industries trust Cribl to solve their most pressing data needs. Ready to do the best work of your career? Join the herd and unlock your opportunity.\n\nSolutions Engineering Manager- EMEA\nWhy You'll Love This Role:\nThe Solutions Engineering Manager is responsible for hiring, mentoring, and assessing Solutions Engineers as it relates to their pre-sales and account management responsibilities.\nAs the Solutions Engineering Manager, you will oversee a team of Solutions Engineers and your goal will be to attract, develop, and retain top talent.\n***This is a remote role based out of UK, Germany, Netherlands, or Dubai\nAs an active member of our team, you will:\n\nLead the Solutions Engineering team, reinforcing sales methodology and best practices, as well as ensuring proper use of our CRM system\nProvide ongoing mentorship to SEs to teach technical and non-technical pre-sales techniques for securing new clients, managing customers, as well as account expansion across multiple solutions\nContinually assess and develop technical capabilities of each team member to ensure each SE reaches and maintains required technical knowledge to effectively perform their pre-sales duties\nProvide periodic performance reviews, assess skill sets, handle personal issues, and provide personal/professional development opportunities\nSupport Sales Reps + SE teams with their sales campaigns and customer management activities in order to ensure a high rate of success and achieve revenue targets, by assessing customer information, identify and address problem areas, formulate relevant solutions, and present solutions effectively\nDeliver sales presentations, present technical information about Cribl’s products and services, conduct product demonstrations and execute Proof of Value events\n\nIf you’ve got it - we want it:\n\nProven ability to communicate effectively in presentations in person, via telephone, and through remote conferencing with executive level customers, direct reports, and the Cribl Leadership Team\nBackground of successfully selling land and expand deals to Strategic Accounts\nAbility to teach ways to identify new and existing opportunities through consultative selling methodologies\nA history of successfully leading a technical pre-sales team that drives target attainment\nMust be able to lead a team and meet monthly, quarterly, and annual quota requirements\nBachelor’s Degree or equivalent AND 3-5 years of experience in a customer facing role OR equivalent combination or education and experience\nAbility to travel up to 30%\nYou live in the UK, Netherlands, Germany, or Dubai\n\nBonus points:\n\nProven self-starter with a motivated attitude to be able to manage multiple tasks, projects, and responsibilities simultaneously.\nAbility to work under pressure and meet deadlines, while maintaining a pleasant and professional attitude towards customers and co-workers\nActive Clearances, repeated history of success to a specific government vertical\n\n#LI-JK1\n#LI-Remote\n\nBring Your Whole SelfDiversity drives innovation, enables better decisions to support our customers, and inspires change for the better. We’re building a culture where differences are valued and welcomed, and we work together to bring out the best in each other. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\nInterested in joining the Cribl herd? Learn more about the smartest, funniest, most passionate goats you’ll ever meet at cribl.io/about-us. \n\n"},{"id":332,"posted_on":"2024-11-28","company":"Axonius","company_logo":"https://remotive.com/job/1953126/logo","position":"Compensation Specialist","category":"Human Resources","tags":"{excel,\"market research\"}","salary":"$112,000 - $132,000 usd","location":"USA","apply_url":"https://remotive.com/remote-jobs/hr/compensation-specialist-1953126","description":"About the Role: \nAs a Compensation Specialist, you will be responsible for conducting research, analyzing data, and developing compensation programs and strategies. You play a crucial role in ensuring fair and equitable competitive compensation practices to attract, retain, and motivate employees. We seek a candidate who has proven experience in the compensation domain, analytical thinker and creative problem solver and who likes to get things done in a global, fast-paced, and changing environment. \nKey Responsibilities:\n\nResponsible for all compensation survey platforms’s data (5 different platforms) - data collecting and sharing and for analyses of market data.\nMaintain job architecture and salary ranges for all company’s jobs in all different countries - ad hoc and on an annual basis for all company’s jobs.\nConduct market analysis to evaluate and determine competitiveness of salaries, bonus, and equity programs.\nSupport and administer the company’s compensation programs, including merit, bonus, and equity. Validate data, facilitate the comp system, monitor process progress, ensure internal equity, and conduct summary analysis. \nDesign and build compensation reports and tools for informed decision-making.\nProvide guidance to People team functions regarding compensation-related matters, such as job offers, promotions, and equity grants. Serve as an active advisor to the business.\nBuild and maintain partnerships across functional teams, including HRIS, FP&A, Payroll, and Legal.\nUse a human-centered approach to create solutions that consider employee experience.\n\nAbout You: \n\nBachelor's degree in Finance, Business Administration, Human Resources, or a related field. Advanced degrees and relevant certifications are a plus.\n3+ years of experience as a Compensation Analyst/Specialist or similar role and a solid understanding of compensation principles, strategies, and practices. Multi-national experience is preferred.\nYou are an Excel / Google Sheets guru and have vast experience with complicated analytical projects. \nYou are accurate and pay extra attention to details. You enjoy creating simple visualizations of complicated analyses and presenting your conclusions. \nYou are familiar with compensation surveys such as Radford, Mercer etc., and worked with these platforms in the past. \nYou are an organized analyst, proactive, detail-oriented, and able to work independently while also contributing to a collaborative team environment.\nYou are comfortable with participating in strategic and long-term planning but also in executing and maintaining day to day responsibilities. Shifting between high-level design, consulting, analytical and operational work.\nYou can manage end to end projects from conception through completion, including identification of all deliverables needed, milestones and timeline.\nYou have excellent communication and interpersonal skills, with the ability to collaborate and build strong relationships at all organizational levels. \nYou embrace changes, know how to navigate through uncertainty, and are able to come up with creative solutions that drive our strategy.\n\n#LI-REMOTE #LI-LW1Axonius is committed to fair and equitable compensation packages. A candidate’s salary will be based on qualifications and relevant experience. In addition to a competitive salary, our packages include stock options, attractive benefits, and an annual bonus.Annual Salary Range (does not include bonus or equity)$112,000—$132,000 USDA little more about Axonius: \nAxonius gives customers the confidence to control complexity by mitigating threats, navigating risk, automating response actions, and informing business-level strategy. With solutions for both cyber asset attack surface management (CAASM) and SaaS management, Axonius is deployed in minutes and integrates with hundreds of data sources to provide a comprehensive asset inventory, uncover gaps, and automatically validate and enforce policies. Cited as one of the fastest-growing cybersecurity startups, with accolades from CNBC, Forbes, and Fortune, Axonius covers millions of assets, including devices and cloud assets, user accounts, and SaaS applications, for customers around the world.\nHeadquartered in New York, New York, Axonius employs over 600 people worldwide. Axonius is named to the 2024 Forbes Cloud 100 and was named to Dun’s Best Start Up Companies to Work for Over 100 Employees. Axonius is recognized with the Great Place to Work Certification™ and for two years in a row, Axonius was ranked Deloitte Technology Fast 500 list. Axonius has been cited as the fastest growing cybersecurity company in history by revenue.\nAt Axonius we support a diverse and inclusive workplace and believe in equal employment opportunity. We welcome people of different backgrounds, experiences, abilities and perspectives, regardless of race, color, ancestry, religion, age, sex, gender identity, national origin, sexual orientation, citizenship, marital status, disability, or Veteran status.\nBy submitting your application to us, you acknowledge that your personal data will be processed in accordance with our Global Job Candidate Privacy Notice."},{"id":333,"posted_on":"2024-11-28","company":"Supabase","company_logo":"https://remotive.com/job/1953370/logo","position":"Cloud Platform / Site Reliability Engineer","category":"DevOps / Sysadmin","tags":"{AWS,golang}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/devops/cloud-platform-site-reliability-engineer-1953370","description":"Supabase is an Open Source and fully remote company building developer tools for databases.We are seeking an SRE to manage the infrastructure of our Postgres databases. We currently manage over 1M Postgres instances and are growing fast.You will:Help build and maintain the Supabase Cloud offering.Improve our system architecture to reduce costs while balancing security, reliability, and performance.Work on designing and tracking metrics for platform uptime.Increase observability into our system by capturing relevant metrics and logs.Implement and maintain intrusion detection, automated remediation and patch management systems.Design CI/CD systems to speed up deployments with proper change and release management processes.Resolve escalated support issues, while also identifying and resolving systemic issues across the platform.You are:Experience in designing multi-tenant database solutions, designing for failover, fault-tolerance, and disaster recovery;5+ years experience in SRE/DevOps/Cloud Infrastructure;4+ years of experience in building with Golang and Typescript;Experience in managing large deployments on AWS;Knowledge of networking;Experience with Infrastructure as Code tools (Pulumi preferred, Terraform/CDK etc also acceptable)Experience with being part of on-call rotations for large production systemsWe offer100% remote work from anywhere in the world. No location-based adjustment to your salary.ESOP (equity ownership in the company)Autonomous work. We work collaboratively on projects, but you set your own pace.Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependentsTech Allowance for any office setup you needAnnual Education AllowanceAnnually run off-sites. About the teamWe're a startup. It's unstructured.Collectively founded more than 30 startups.Globally distributed team with more than 30 different nationalities.We deeply believe in the efficacy of collaborative open source. We support existing communities and tools, rather than building \"yet another xx\".We \"dogfood\" everything. If you use it in your project, we use it in Supabase.ProcessThe entire process is fully remote and all communication will happen over email or via video chat.Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.If you pass the screen you will be invited to up to four follow-up interviews. The calls:usually take between 20-45 minutes each depending on the interviewer.most of the time, are all 1:1.will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.Once the interviews are over, the team will meet to discuss several roles and candidates and may:ask one or two follow-up questions over email or a quick call.go directly to making an offer."},{"id":334,"posted_on":"2024-11-28","company":"Sinch","company_logo":"https://remotive.com/job/1953345/logo","position":"Anti-spam / Anti-fraud Product Manager","category":"Product","tags":"{cybersecurity,\"risk management\"}","salary":"","location":"UK","apply_url":"https://remotive.com/remote-jobs/product/anti-spam-anti-fraud-product-manager-1953345","description":"About SinchSinch is pioneering the way the world communicates. More than 150,000 businesses — including Google, Uber, Paypal, Visa, Tinder, and many others — rely on Sinch’s Customer Communications Cloud to power engaging customer experiences through mobile messaging, voice, and email. Whether you need to verify users or craft omnichannel campaigns, Sinch makes it easy. Our AI-infused Super Network, APIs, and applications ensure you can connect with your customers reliably and securely, at every step of their journey. At Sinch we “Dream Big”, “Win Together”, “Keep it simple”, and “Make it Happen”. These values are our foundation! DescriptionWe are seeking an experienced Anti-Spam / Anti-Fraud Product Manager to lead and coordinate our efforts from a product and policy perspective in detecting, preventing, and responding to fraudulent activities and spam within our various messaging platforms at Sinch (A2P, P2P, RCS, SMS, MMS, etc.). The ideal candidate will have a strong background in cybersecurity, risk management, and telecommunications, along with a drive for protecting and maintaining the integrity of Sinch’s messaging platforms.Key Responsibilities: Product & Roadmaps:  Develop and implement comprehensive anti-fraud and anti-spam strategies to mitigate risks associated with messaging at Sinch, collaborating with key messaging platform stakeholders. Own and drive the product roadmaps for Anti-spam / Anti-fraud across all messaging platforms at Sinch. Modify the roadmaps as required based on changing business requirements, balancing the business needs with effort and timing. Collaborate and coordinate with engineering on the roadmaps and associated deliverables and explore options to enhance detection algorithms and reporting tools. Identify synergies and ways to leverage messaging data analytics and insights across platforms. Take the lead role in interacting with 3rd party providers that Sinch engages for Anti-spam / Anti-fraud services and streamline the operations and costs associated with these 3rd parties. Build relationships with regulatory bodies, industry groups, and other messaging providers to share insights and best practices. In addition, share Spam / Fraud best practices from other business units at Sinch that are outside the messaging platforms (e.g. email) Be the subject matter expert for Artificially Inflated Traffic (AIT), working with Sinch Engineering and Operational teams to combat   Policy Development:  Collaborate with messaging platform stakeholders to establish and maintain policies and procedures related to anti-spam and anti-fraud measures and incorporate any product requirements into the roadmaps as required. Ensure compliance with industry regulations (e.g. GDPR) and best practices in collaboration with country managers Lead role in collaborating with GSMA and other industry bodies on spam / fraud related topics and industry wide initiatives.  Collaboration and Training:  Work closely with support, product, and marketing teams to educate key platform stakeholders on Sinch’s Anti-fraud and Anti-spam practices and capabilities. Work with marketing to create training materials and conduct training when required on product and features. Support sales as required in customer dialogues specifically related to Sinch’s capabilities in the area of Anti-spam / Anti-fraud and our plans for future improvements. Support the investigation of reported fraud and spam incidents, as needed, coordinating with relevant internal and external stakeholders. Support in engaging with law enforcement agencies, as needed, for investigations related to fraud.  Reporting and Analytics:  Lead role in designing reports on fraud, spam AIT trends, incidents, and mitigation efforts for senior management, this includes KPI’s to assess the effectiveness of our internal Anti-spam / Anti-fraud controls and drive improvements as required. Utilize data analytics to continuously improve detection methods and reduce false positives.  Requirements Bachelor’s degree in Computer Science, Information Security, or a related field; advanced degree preferred. 5+ years of experience in anti-fraud, cybersecurity, or risk management roles, preferably in the telecommunications or messaging industry. Strong understanding of SMS  and other messaging protocols, telecommunications regulations, and current fraud trends. Proficiency in data analysis tools and fraud detection technologies. Excellent problem-solving skills and the ability to think critically under pressure. Strong communication, written and interpersonal skills to collaborate effectively across teams. Embrace the challenge and join us!  Our Hiring ProcessWe are committed to ensuring a recruitment process that is fair, objective, consistent, and inclusive. Our approach includes structured, competency-based interviews designed to evaluate your skills, experience, and qualifications relevant to the role. At times, we may include a data-driven assessment to enhance our hiring success and identify candidates likely to excel.  We believe in a two-way process and encourage you to ask questions throughout the journey.  If this role isn't what you're looking for, please explore the other opportunities listed on our career page: https://www.sinch.com/careers/. No matter who you are, we hope you find an exciting path forward - hopefully with us!  About the companySinch brings businesses and people together\nthrough tools enabling personal engagement.\nWe partner with leading global enterprises\nand local startups, enriching their engagement\nwith customers through our communications\nplatform.If you get us talking about the old days we’ll tell\nyou what it was like to be the early pioneers of\ncloud communications. But lately, what we’re\nbuzzing about is the fact that we’re trusted to carry 25 billion API calls a year, and we get\nexcited about the value that brings to so many\npeople’s every day lives."},{"id":335,"posted_on":"2024-11-28","company":"Veeam Software","company_logo":"https://remotive.com/job/1953313/logo","position":"Senior Manager, Web Design","category":"Design","tags":"{\"visual design\"}","salary":"$141,500 - $202,200 usd ote","location":"USA","apply_url":"https://remotive.com/remote-jobs/design/senior-manager-web-design-1953313","description":"Veeam®, the #1 global market leader in data protection and ransomware recovery, is on a mission to empower every organization to not just bounce back from a data outage or loss but bounce forward.\nWith Veeam, organizations achieve radical resilience through data security, data recovery, and data freedom for their hybrid cloud. \nThe Veeam Data Platform delivers a single solution for cloud, virtual, physical, SaaS, and Kubernetes environments that gives IT and security leaders peace of mind that their apps and data are protected and always available.\nHeadquartered in Seattle with offices in more than 30 countries, Veeam protects over 450,000 customers worldwide, including 74% of the Global 2000, who trust Veeam to keep their businesses running.\n\n Are you passionate about website user journeys? Do you enjoy the challenge of making web pages beautiful and engaging that are also intuitive and on brand? If so, come step into a people leader role and help us work across multiple teams and elevate our Veeam.com digital experience with design.  \nResponsibilities: \n\n Manage a team of 3+ web and digital designers, providing guidance, mentorship, and constructive feedback.\n Foster a culture of innovation, collaboration, and continuous learning.\n Develop and implement design processes, standards, and best practices.\n Define and drive the visual design direction for web applications and marketing sites.\n Develop and maintain design systems, ensuring consistency across products.\n Collaborate with product marketing, digital experience team, web developers, and other stakeholders to align design with business goals.\n Conduct design research, analyze user feedback, and inform design decisions.\n\nRequirements: \n\n8+ years of experience in web design, with 3+ years in a leadership/management role. \nPortfolio showcasing expertise in visual design, user experience, and product design. \nStrong understanding of design principles, user research, and human-centered design. \nExcellent communication, leadership, and project management skills. \nExperience managing designers, providing constructive feedback, and guiding career development. \nStrong problem-solving skills, attention to detail, and ability to prioritize tasks. \nBachelor's degree in Design, Human-Computer Interaction, or related field. \n Experience with Agile development methodologies \nKnowledge of design systems and style guides \n Familiarity with front-end frameworks (React, Angular) \nCertification in design or related field (e.g., UX Design, Design Thinking) \nExperience with design tools: Adobe CC (Photoshop, Illustrator), Figma  \nFamiliarity with UI/UX design principles, user-centered design methodologies \nKnowledge of accessibility guidelines (WCAG 2.1) \nProficient in HTML, CSS, JavaScript (front-end development) \nProject management tools (Jira, Monday) \n\nWhat We Offer: \n\nCompetitive salary and benefits package \nOpportunity to lead and grow a talented design team \n Collaborative, dynamic work environment \nProfessional development and training opportunities \nRecognition and rewards for outstanding performance \n\n#LI-TS1 #remote\n \n \n The salary range posted is On Target Earnings (OTE), which is inclusive of base and variable pay. When making an offer of employment, Veeam will take into consideration the candidate’s expectations, experience, education, scope of responsibility for the role, and the current market demands.United States of America Pay Range$141,500—$202,200 USD\nVeeam Software is an equal opportunity employer and does not tolerate discrimination in any form on the basis of race, color, religion, gender, age, national origin, citizenship, disability, veteran status or any other classification protected by federal, state or local law. All your information will be kept confidential.\n\nPlease note that any personal data collected from you during the recruitment process will be processed in accordance with our Recruiting Privacy Notice.  \nThe Privacy Notice sets out the basis on which the personal data collected from you, or that you provide to us, will be processed by us in connection with our recruitment processes. \nBy applying for this position, you consent to the processing of your personal data in accordance with our Recruiting Privacy Notice.\n\n"},{"id":336,"posted_on":"2024-11-28","company":"SnappyCX","company_logo":"https://remotive.com/job/1953249/logo","position":"Bilingual Customer Service – English and Spanish","category":"Customer Service","tags":"{troubleshooting}","salary":"usd 7 per hour","location":"Colombia","apply_url":"https://remotive.com/remote-jobs/customer-support/bilingual-customer-service-english-and-spanish-1953249","description":"Job Summary: We are seeking a dedicated and personable Customer Support Agent to join our team. In this role, you will be the first point of contact for our customers, providing exceptional service by addressing inquiries, resolving issues, and ensuring customer satisfaction.\nKey Responsibilities:\nRespond to customer inquiries via email, chat, and phone in a timely and professional manner.Resolve customer issues by identifying problems, troubleshooting, and offering effective solutions.Maintain accurate records of customer interactions and transactions in our support system.Collaborate with other teams to escalate and resolve complex customer issues.Proactively identify opportunities to improve customer experience and contribute to team goals.\nQualifications:\nPrevious experience in customer support or a similar role is preferred.Strong verbal and written communication skills.Ability to multitask and manage time effectively in a fast-paced environment.Tech-savvy with proficiency in using customer support tools and systems.A positive attitude and a passion for helping others."},{"id":337,"posted_on":"2024-11-28","company":"ReifyHealth","company_logo":"https://remotive.com/job/1954087/logo","position":"Software Engineer","category":"Software Development","tags":"{AWS,docker,git,\"functional programming\"}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/software-dev/software-engineer-1954087","description":"At OneStudyTeam (a Reify Health company), we specialize in speeding up clinical trials and increasing the chance of new therapies being approved with the ultimate goal of improving patient outcomes. Our cloud-based platform, StudyTeam, brings research site workflows online and enables sites, sponsors, and other key stakeholders to work together more effectively. StudyTeam is trusted by the largest global biopharmaceutical companies, used in over 6,000 research sites, and is available in over 100 countries. Join us in our mission to advance clinical research and improve patient care.\nOne mission. One team. That’s OneStudyTeam.We're looking for a Software Engineer with a passion for continuous learning who applies newly acquired skills to your daily work. You delight in solving difficult problems, pay close attention to detail, and believe in the value of automation. You shine as a collaborator and excel as an individual contributor. You have the courage to lead and to tackle extremely difficult problems as a member of a powerful team. Your personal initiative and discipline allow you to thrive while working remotely. Your high degree of empathy for others makes you the kind of colleague everyone wants on their team. As an integral member of a fast-growing organization, you will put your fingerprint on what we do and how we do it.\nWhat You’ll Be Working On:\n\nDeliver extraordinary software that solves complex, real-world problems in healthcare.\nBuild high-quality, maintainable, and well-tested code across our entire application. We value the developer who focuses on “front-end” or “back-end”, as specialization brings deep technical understanding, leading to the ability to solve difficult problems elegantly.  We also value the developer who brings their own specialties, and who will enjoy working across our entire application stack. \nStrive for technological excellence and accomplishment through the adoption of modern tools, processes and standards.\nWork closely with our Design and Product teams as features move through the value stream.\nSupport your teammates in an environment where collaboration, respect, humility, diversity and empathy are prized.\n\nWhat You’ll Bring to OneStudyTeam:\n\nYou have a minimum of 5 years of professional software product development in an Agile environment, ideally developing SaaS products.\nThe applicant we are looking for has experience in functional programming, has a passion for learning and personal growth, and  works best when working with a team of diverse but like-minded individuals.\nYou have real-world experience building software with functional programming languages like with languages like Clojure, Haskell, Lisp, F#, etc...\nYou have great oral and written communication skills and are comfortable with collaboration in a virtual setting. \nYou demonstrate an enthusiastic interest to learn new technologies.\nYou are comfortable with modern infrastructure essentials like AWS, Docker, CI/CD tools, etc.\nYou are proficient with common development tools (e.g. Git, Jira) and processes (e.g. pairing, testing, code reviews).\nPrior experience in the healthcare domain, especially clinical trials and/or HIPAA Compliance is a plus.\nWe value diversity and believe the unique contributions each of us brings drives our success. We do not discriminate on the basis of race, sex, religion, color, national origin, gender identity, age, marital status, veteran status, or disability status.\nNote: OneStudyTeam is unable to sponsor work visas at this time. If you are a non-U.S. resident applicant, please note that OneStudyTeam works with a Professional Employer Organization.\nAs a condition of employment, you will abide by all organizational security and privacy policies.\nThis organization participates in E-Verify (E-Verify's Right to Work guidance can be found here)."},{"id":338,"posted_on":"2024-11-28","company":"Businessolver","company_logo":"https://remotive.com/job/1953364/logo","position":"Business Intelligence Analyst","category":"Data Analysis","tags":"{sql,\"business analysis\",\"data visualization\",ETL}","salary":"57k to 89k per year","location":"USA","apply_url":"https://remotive.com/remote-jobs/data/business-intelligence-analyst-1953364","description":"Since 1998, Businessolver has delivered market-changing benefits technology and services supported by an intrinsic responsiveness to client needs. The company creates client programs that maximize benefits program investment, minimize risk exposure, and engage employees with easy-to-use solutions and communication tools to assist them in making wise and cost-efficient benefits selections. Founded by HR professionals, Businessolver's unwavering service-oriented culture and secure SaaS platform provide measurable success in its mission to provide complete client delight.The successful Business Intelligence Analyst is well-organized and detail-oriented.  You will be a seeker when it comes to gathering data, fast on your feet to turn data into insight and ready to relate stories interdepartmentally for the betterment of our brand and, ultimately the delight of our clients.  We are looking for a discerning, prepared and flexible Analyst who thrives in a fast-paced environment.  That’s where you come in. \nThe Gig:\n\nCollaborate with diverse resources company-wide to meet timeline objectives\nEnd-to-end ownership of projects within the BI Development Lifecycle\n\nConsultative requirements gathering with internal stakeholders\nCreate, schedule, and maintain ETL/ELT processes (e.g. new data sources, data cleansing, aggregate/analytics tables)\nLeverage SQL to create or modify data sets for efficient and accurate analysis\nVisualize data insights through the design and implementation of BI dashboards\nData storytelling of dashboards to internal stakeholders\nCreate any necessary documentation for business users\n\n\nAssist in the administration of BI software and end user support\nPerform data mining and analysis to solve business questions and identify actionable insights\nEmpower business units to self-service through available BI tools\n\nWhat you need to make the cut:\n\nBachelor's degree in Business, Statistics, Business or Data Analytics, Computer Science, Engineering, MIS or a related field\n3+ years of professional experience in analytics, business analysis or comparable consumer analytics position\nAdvanced working knowledge of data mining using SQL, ETL, data warehouse, data visualization, as well as Excel\nExcellent communication (verbal and written) and interpersonal skills and an ability to effectively communicate with both business and technical teams.\nStrong operational business understanding, including potential impact of business decisions on various areas\nWriting efficient and quality SQL code by following best practices of the team and rigorous testing/validation\nProvide quality customer service to internal stakeholders by exhibiting the core BSC values during all interactions and meetings\nEffective data analysis and visualization through stakeholder collaboration combined with domain and analytical expertise\nGrow in domain knowledge expertise through data exploration and being a seeker of knowledge\n\nThe pay range for this position is 57K to 89K per year (pay to be determined by the applicant’s education, experience, knowledge, skills, abilities, balanced against internal equity and competitive market based geographic ranges).\n Other Compensation:  If this position is full-time or part-time benefit eligible, you will receive a comprehensive benefits package which can be viewed here: https://businessolver.foleon.com/bsc/job-board-businessolver-virtual-benefits-guide/ \nThe Businessolver Way…\nOur team has spent two decades crafting a culture that challenges each employee to perform at the top of their game – and have fun doing it! If you desire to use your skills and experience in an environment where you can make a difference, we want to hear from you!\nBusinessolver is committed to maintaining an environment that protects client data. We train our employees to maintain leading class security practices and expect all employees to adhere to policy, procedures and controls.\n(Applicable to all roles at an AVP, DIR, VP, Head Of or SVP and above level):\nServe as a security contact for the business unit. Responsible for driving adoption and compliance with information security and privacy practices. Serve as a liaison with the information security team on security and privacy matters.\nEqual Opportunity at Businessolver:\nBusinessolver is an Affirmative Action and Equal Opportunity Employer and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\n#LI-Remote"},{"id":339,"posted_on":"2024-11-28","company":"QRY","company_logo":"https://remotive.com/job/1953453/logo","position":"Paid Search Strategist","category":"Marketing","tags":"{amazon,ecommerce,\"social media\",video,analytics,advertising,healthcare,youtube,retail,adwords,\"marketing strategy\",\"google ads\",\"paid media\",\"time management\",\"Digital advertising\",insurance,SEM}","salary":"$70,000 - $85,000 per year","location":"USA","apply_url":"https://remotive.com/remote-jobs/marketing/paid-search-strategist-1953453","description":"QRY 101Hey there! We're QRY, a media-buying agency that specializes in scaling e-commerce brands. We know the ins and outs of paid media, use sophisticated data analytics, and employ a full-funnel marketing strategy to help brands reach their most valuable consumers. We're not just any company - we're driven, innovative, and all about creating a happy environment where people love what they do.We’re looking for a Paid Search Strategist to join our rapidly growing team. The Paid Search Strategist will be responsible for developing, implementing, tracking, and optimizing paid search campaigns across multiple clients. If you have experience leading and managing search / SEM budgets for retail and ecommerce brands, this could be a perfect position. You should have a strong understanding of how platforms, especially Google AdWords and Bing Ads, work and can be optimized and how to confidently communicate complex strategies and analytic results in an easy-to-understand manner. Last but not least, you should be independent, ambitious, driven, intellectually curious, and have a good sense of humor.Sound good so far? Great! Let’s learn more about what the role involves…Your day-to-dayThis role involves successfully managing client campaigns in the digital advertising space across 4 main sectors: Search Strategy:   You’ll plan, book, and optimize paid search campaigns (i.e. Google AdWords, Youtube, Bing Ads, Amazon, etc) for 5-8 clients, utilizing available search planning tools to develop search plans. You’ll strategize and implement A/B experiments to test keywords, bid strategies, ad copy, landing pages, offers, etc You’ll advise on paid search strategies, rationales and plans to meet client goals. You’ll keep current on the latest trends in search, social media, mobile marketing, tracking and tagging, behavioral marketing, retargeting & addressability With support from Associate Directors, you’ll manage the channel's monthly reporting and strategy sessions with the client, owning overall communication for all channel initiatives.  Performance:   You’ll scope, develop, and manage channel initiatives to consistently hit the goals for channels across all clients. You’ll act as a strategic advisor and recommend strategic pivots to increase the channel's performance.  Reporting + Forecasting:   You'll enthusiastically present reports to clients highlighting the performance of your channels, how it assisted other channels in the funnel, how it affects the client's business, and recommended next steps. You’ll complete a monthly forecast for respective channels based on budget and/or revenue goals.  Cross Channel Strategy + Collaboration:   You’ll collaborate with the other media and creative agency team members to ensure creative specifications of negotiated plans are met. You’ll consistently identify cross-channel strategies / collaborations with clients to improve performance. You’ll effectively communicate with clients on teams' capabilities and opportunities and proactively offer solutions for ad hoc issues.  RequirementsWhat makes you a great fit✍️​ Experience: You have successful hands-on paid search or SEM experience in an agency environment. You know the ins and outs of making things run smoothly and have applied successful tactics in a previous role.📚 Education: Ideally, you have a bachelor's degree in marketing, science, or in a related field.🔢 Analytical Mindset: You're an analytical thinker. You have experience turning complex data into digestible reports, seeing the big picture, and breaking it down into an actionable plan that gets results.💬​ Communication: Your communication skills are top-notch and you can communicate with senior stakeholders effectively and efficiently. ⌚ Time Management: You're a master of time management. You know how to juggle multiple tasks effectively.🚀​ Industry Passion: The e-commerce, advertising, and agency space excite you. You're genuinely interested in these fields and eager to make an impact within them.🧠​ Creative Problem Solver: When challenges arise, you're ready to jump in and troubleshoot with creative solutions. You enjoy tackling problems head-on and finding innovative ways to overcome them.💡​ Continuous Learner: You have a genuine passion for learning. You stay updated with the latest trends in digital advertising and marketing, always expanding your knowledge base.🖥️​ Remote Work Environment: You understand the importance of a clean and quiet work environment suitable for video conferencing. You respect digital etiquette and ensure smooth virtual collaboration.BenefitsQRY encourages every team member to bring their whole self to work and we provide perks and benefits that matter in making this a reality. 🤑 Competitive salary. We offer a market-rate salary ranging from $70,000.00 - $85,000.00 per year, based on experience.💰 Quarterly bonuses. Enjoy quarterly bonuses tied to company revenue. 🏠 USA remote flexibility. Choose your ideal workspace, whether it’s your home office or a coffee shop.🌴 Time off made easy. Take advantage of our unlimited PTO policy (at least 14 days annually) and our 14 paid company holidays. 🏥 Comprehensive healthcare. We prioritize your wellbeing with exceptional health, dental, and vision insurance, fully covered for employees by QRY. We also offer a $100 monthly budget for your wellbeing, i.e. gym memberships, coworking day pass, etc. 📈 Secure your future. Participate in our 401k program with a company match.🌱 Growth and development. Nurture your learning and development with our investment to L&D, growth opportunities, and tools such as our Learning & Development Philosophy + Policy, role matrices, and skill assessments. 💻 Latest tech. Team members are provided with the latest Macbook Pro and a one-time $500 stipend to set up their at-home workspace.🥳 Celebrate and connect. Join us for annual team retreats (we’ve been to Austin, Tennessee, and Utah to name a few), weekly Coffee Chats, and monthly Happy Hours to foster our vibrant culture."},{"id":340,"posted_on":"2024-11-28","company":"Liftoff","company_logo":"https://remotive.com/job/1953514/logo","position":"Manager, Business Marketing","category":"Marketing","tags":"{\"team management\"}","salary":"competitive market rate with equity and benefits","location":"USA","apply_url":"https://remotive.com/remote-jobs/marketing/manager-business-marketing-1953514","description":"Liftoff is the leading growth acceleration platform for the mobile industry, helping advertisers, publishers, game developers and DSPs scale revenue growth with solutions to market and monetize mobile apps. \nLiftoff’s solutions, including Accelerate, Direct, Influence, Monetize, Intelligence, and Vungle Exchange, support over 6,600 mobile businesses across 74 countries in sectors such as gaming, social, finance, ecommerce, and entertainment. Founded in 2012 and headquartered in Redwood City, CA, Liftoff has a diverse, global presence.Opportunity:\nLiftoff is seeking an experienced Marketing Manager to lead the development and execution of innovative global marketing strategies. In this role, you will oversee a diverse range of campaigns and marketing activations across email, webinars, content, events, and paid media. You will work closely with cross-functional teams to ensure alignment with sales priorities and business goals.\nThe ideal candidate is a creative, strategic, and data-driven leader with 6+ years of B2B marketing experience and a proven track record of success in digital and partner marketing. This is a unique opportunity to shape Liftoff’s global thought leadership, manage strategic partnerships, and lead a high-performing team that drives brand visibility and business growth.\nResponsibilities:\n\nDevelop and execute global marketing campaigns across email, webinars, content, research reports, and paid media, highlighting Liftoff’s thought leadership and driving engagement with prospects, customers, and partners.\nCollaborate with cross-functional teams (sales, product marketing, brand, event teams) to align marketing efforts with business objectives.\nManage key partnerships, PR, and vendor relationships, providing strategic recommendations to enhance partnerships and maximize value for Liftoff.\nLead global thought leadership initiatives, setting the vision and overseeing strategic campaigns to position Liftoff as an industry leader.\nSupport regional marketing efforts for customer summits, conferences, and events to drive brand engagement and visibility.\nUtilize data-driven insights to identify growth opportunities and optimize marketing strategies for maximum impact.\nOversee the production of marketing materials, ensuring timely delivery of event pages, decks, case studies, and blog posts.\nGuide and manage the content team, ensuring the production of high-quality, impactful work that aligns with business goals.\nAnalyze and optimize marketing performance, leveraging data to measure success and continuously improve programs.\nManage website updates and other digital properties, optimizing for user experience and performance.\n\nSkills:\n\nProven B2B marketing leadership: Proven track record with 6+ years of experience in high-tech marketing, experience in the mobile app industry a plus.\nHolistic marketing expertise: An understanding of how to build and execute a unified, multi-channel marketing strategy that integrates digital, event, content, and partner marketing to drive business objectives and enhance brand visibility across global markets.\nPartner and digital marketing expertise: Demonstrated success in leading partner, digital and field marketing programs within a B2B environment. Experience with all segment sizes, from Enterprise to SMB.\nTeam management: 3+ years of experience managing and developing high-performing marketing teams.\nData-driven approach: Strong analytical skills to measure campaign performance, identify insights, and optimize strategies.\nTechnical proficiency: In-depth understanding of marketing technologies (automation platforms, website tools, analytics, CRM) and a willingness to adopt new technologies.\nInnovative and growth mindset: Forward-thinking and continuously seeking ways to improve and innovate\nCommunication and collaboration: Excellent interpersonal and communication skills to build relationships with cross-functional teams.\nBusiness acumen: Deep understanding of customer needs and ability to translate them into effective marketing campaigns.\n\n#LI-EL1\n#LI-Remote\n \nWe use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on January 22, 2024.\nPlease see the independent bias audit report covering our use of Covey here.Liftoff is committed to providing and maintaining a work environment where all employees and candidates are treated with dignity and respect and that is free of bias, prejudice, and harassment. Liftoff is further committed to providing an equal employment opportunity for all employees and candidates for employment free from discrimination and harassment on the basis of sex, gender (including sexual harassment, gender harassment, and harassment due to pregnancy, childbirth, breastfeeding, and related conditions), sexual orientation, gender identity, gender expression, gender nonconformity, race, creed, religion, color, national origin, ancestry (including association, affiliation, or participation with persons or activities related to national origin, English-proficiency or accent, or immigration status), physical or mental disability, medical condition(s), genetic information of an individual or family member of the individual, marital or domestic partner status, age, veteran or military status, family care status, requesting or taking pregnancy, parental or disability leave, requesting an accommodation, or any other characteristic protected by federal, state, or local law, regulation, or ordinance. All such discrimination and harassment is unlawful and will not be tolerated. Liftoff maintains a continued commitment to equal employment opportunity and expects the full cooperation of all personnel.\n \nLiftoff's Compensation Strategy\nLiftoff's compensation strategy includes competitive market rate along with equity and benefits and perks that will give our employees what they need to do their best work. In order to ensure teams are compensated fairly for the work performed, we map out specific levels and take into consideration the cost of labor within each location. Liftoff provides employees a total compensation package of competitive market salaries, equity, health and wellness stipends, medical benefits associated with your country of residence. The base compensation will vary based on location, experience as well as level.\n \nAgency and Third Party Recruiter Notice:\nLiftoff does not accept unsolicited resumes from individual recruiters or third-party recruiting agencies in response to job postings. No fee will be paid to third parties who submit unsolicited candidates directly to our hiring managers or Recruiting Team. All candidates must be submitted via our Applicant Tracking System by approved Liftoff vendors who have been expressly requested to make a submission by our Recruiting Team for a specific job opening. No placement fees will be paid to any firm unless such a request has been made by the Liftoff Recruiting Team and such a candidate was submitted to the Liftoff Recruiting Team via our Applicant Tracking System."},{"id":341,"posted_on":"2024-11-28","company":"Jump","company_logo":"https://remotive.com/job/1953021/logo","position":"Senior Software Engineer","category":"Software Development","tags":"{AWS,node.js,react}","salary":"$185,000 plus equity","location":"USA","apply_url":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-1953021","description":"DescriptionJump is the only end-to-end fan experience platform built for sports teams and venues, breaking the mold for what fans can expect at live events.Jump’s enterprise software enables sports teams and venues to unlock the massive opportunities that come from real relationships with their fans, rethinking the traditional model that hasn’t put the fan experience first.Founded in 2021 by Marc Lore, Alex Rodriguez, and Jordy Leiser and backed by top venture firms including Forerunner Ventures, Will Ventures, Mastry Ventures, Courtside Ventures, and more, we’re just getting started!We are a remote first team that grounds our actions and decisions in our core values — begin with trust, play like the underdog, and do your thing. Living our values means that we always assume positive intent, show up with authenticity and empathy, and push the limit of what is possible with our collective creativity.We’re actively recruiting for smart, tenacious, adaptable, and most importantly kind people to join our team!The RoleWe are looking for a talented engineer to join our team. In this fullstack role, you will work with a team of passionate engineers, product managers, and designers to build transformational experiences for fans and teams. You’ll tackle complex technical challenges using your keen coding skills and strong system design expertise. You’ll be responsible for developing core components of our product offering, changing the game for what fans can expect at live events.What You’ll DoSynthesize complex business, product, and technical requirements to consistently produce high-quality system designs and software in addition to task break-down, delivery and monitoringTake ownership of and design core software componentsDevelop highly-optimized software that operates at scale for both front-end and backend.Design and build backend components, APIsConduct design and code reviews, taking accountability for bug fixes and ensuring standards for code quality are metCollaborate with other engineers, product managers, and designers to build the productContinuously learn on the job to build domain expertiseWhat You’ll Bring6+ years of hands-on experience developing large, well-tested applicationsProficient in Typescript, React, and Node.js Experience building both backend and web front ends Experience with cloud technologies, particularly AWSRelentless about quality and doing the right thingA detailed approach to writing tests (i.e. unit, integration, performance)Nice-to-Have SkillsMS or BS in Computer Science.Experience with event driven architectureExperience with Nest.jsExperience with PostgresExperience infrastructure as code technologies (e.g. Terraform)Attributes that will make you successful on our teamA strong desire to learn. You have strong experience and want to continue building your technical skills.Tenacity. You enjoy working on challenges that others can’t or don’t want to tackle and you aren’t afraid of failing fast in order to find better solutions.Passion. You love using your technical skills to build products that solve real problems. You hold yourself to a high standard and help to elevate others as well.Empathy. You thrive in an environment where everyone can truly be themselves. You understand that our differing life experiences influence who we are and how we show up, and these diverse perspectives enrich both our team and our product.Customer-centric mindset. You can understand the problem to be solved and who we are solving it for.Innovation: Passion for exploring and implementing AI technologies to enhance automation, optimize workflows, and drive innovationBenefitsRemote firstCompetitive salary and equityFlex PTO policy401(k)Generous medical, dental and vision plans16 weeks paid parental leave for primary and secondary caregivers$1,000 reimbursement for work-from-home tech setupCompany-paid sustainability subscription to ensure carbon neutrality is maintained for employee activities, such as travelCompensationCompensation is something we don’t want our candidates or employees to worry about. Our goal is to offer competitive salaries that are regularly benchmarked against the market. The core tenants of our compensation philosophy are fairness and transparency.We have established a standardized leveling framework based on job scope and responsibilities. The compensation package for each level is standard across all engineering roles. This means that every person at a certain level is paid the same as everyone else, regardless of their background, previous compensation, location, or any other factor.The compensation for this role is $185,000 and includes a generous equity package.ApplicationSome candidates may see the requirements and feel unsure that they match all the criteria. We encourage you to apply! There's a good chance you have important skills that we have not stated. We especially encourage members of traditionally underrepresented communities to apply, including women, nonbinary folx, people of color, members of the LGBTQ community, veterans, and people with disabilities. We’re committed to building an inclusive workplace where everyone can bring their authentic self and thrive, and we value the diversity brought by different life experiences."},{"id":342,"posted_on":"2024-11-28","company":"CharCentric","company_logo":"https://remotive.com/job/1953592/logo","position":"Backend Software Engineer","category":"Software Development","tags":"{git,node.js,python,sql,\"system architecture\"}","salary":"","location":"Indonesia","apply_url":"https://remotive.com/remote-jobs/software-dev/backend-software-engineer-1953592","description":"CharCentric is an ambitious technology firm that offers technology consulting and engineering services to emerging and established businesses worldwide. We pride ourselves on delivering innovative solutions, maintaining a high standard of quality, and fostering a culture of knowledge sharing and collaboration.\nWe are seeking a Backend Developer to join our team and work on exciting projects, including an AI Data Platform. While your first contribution will be on this platform, CharCentric offers diverse consultancy opportunities that span various industries and technologies. If you’re passionate about backend development, thrive in a collaborative environment, and have a can-do attitude, we’d love to hear from you.\nTasks\nThe scope of work involves:\n\nDesign, develop, and maintain robust backend systems for scalable applications.Integrate AI services into applications to enhance functionality.\nImplement and optimize database management and performance.\nConduct stress and load testing, coordinating with the infrastructure team to ensure scalability.\nWrite and maintain detailed technical documentation, including UML diagrams and technical requirements.\nImplement technical designs individually or as part of a team.\nDevelop unit, integration, and end-to-end (E2E) tests for backend components.\nConduct stress and load testing, coordinating with the infrastructure team to ensure scalability.\nCollaborate with cross-functional teams, attending calls, design meetings, and discussions.\nMonitor and resolve issues reported by clients, providing technical support when necessary.\n\nRequirements\nMust-Have Skills\n\nMust be located within the GMT +2 to GMT +9 time zones.\n2-8 years of backend development experience.\nProficiency in Python (e.g., FastAPI, Flask) and Node.js/NestJS.\nExperience with SQL databases (e.g., BigQuery, SQL Server).\nFamiliarity with testing frameworks and methodologies for backend services (unit, integration, and E2E testing).\nStrong grasp of system architecture and Domain-Driven Design (DDD).\nKnowledge of clean architecture principles.\nGit version control and collaborative development practices.\n\nNice-to-Have Skills\n\nExperience with cloud platforms (AWS, Azure, etc.).\nFamiliarity with messaging systems (e.g., RabbitMQ, Kafka).\nKnowledge of AI frameworks (TensorFlow, PyTorch).\nUnderstanding of containerization (Docker) and CI/CD pipelines\n\nCharCentric takes pride in its clients and does its best to ensure all projects not only be completed successfully but also in style. Hence, self-driven engineers with a can-do attitude are critical to our success.\nOur ideal candidate is an engineer who can demonstrate:\n\nGreat communication skills.\nGreat problem-solving skills.\nWorking as part of a team, or leadership skills.\nAbility to write and speak English clearly.\nQuick learning and high adaptability.\nWriting high-quality code and delivering high-quality solutions.\nDesigning & architecting software according to requirements.\nExperience with databases and writing efficient queries.\nGood handle on client communication.\n\nMinimum Qualifications:\n\nA bachelor’s degree in Information Technology, Computer Science, Software Engineering, Computer Engineering or other relevant disciplines.\n\nAbout the company\nCharCentric is an ambitious technology firm that offers technology consulting and engineering servies to emerging and established businesses worldwide.\n"},{"id":343,"posted_on":"2024-11-28","company":"Launch2","company_logo":"https://remotive.com/job/1953404/logo","position":"Campaign Performance and QA Analyst","category":"QA","tags":"{\"project management\",documentation,advertising,\"digital media\",tableau,asana,testing,diversity,\"performance marketing\"}","salary":"$1,500 - $2,500 (usd) per month","location":"Brazil","apply_url":"https://remotive.com/remote-jobs/qa/campaign-performance-and-qa-analyst-1953404","description":"\nWHO ARE WE?\nLaunch Potato is a digital media company with a portfolio of brands and technologies. As The Discovery and Conversion Company, Launch Potato is a leading connector of advertisers to customers at all parts of the consumer journey, from awareness to consideration to purchase.\nThe company is headquartered in vibrant downtown Delray Beach, Florida, with a unique international team across over a dozen countries. Launch Potato's success comes from a diverse, energetic culture and high-performing, entrepreneurial team. As a result, the company is always looking for like-minded teammates and partners.\n\nCONTRACT NON-NEGOTIABLES\n\nYou’re available to work 40 hours per week, Monday - Friday.\nYou’re comfortable working somewhere between 7:00 am to 6:00 pm Eastern Standard Time \nYou have outstanding communication, presentation, and interpersonal skills and are fluent in English, both written and spoken\nYou're highly detail-oriented and reliable\nYou have excellent administrative skills with the ability to multitask and adapt in a fast-paced remote environment is required\n\nBASE SALARY: $1,500 - $2,500 (USD) per month\n \nYOUR ROLE\nYou are a detail-oriented, results-driven professional with a passion for maintaining the highest standards of quality and efficiency in operational processes and procedures. Everything goes through QA, so you will be directly responsible for ensuring the success of our campaign launches which connect millions of consumers to our clients monthly! You will also be responsible for overseeing and optimizing our operations to ensure they meet and exceed industry standards and organizational objectives. \nYour unwavering attention to detail and thorough analysis skills will be invaluable in detecting and identifying potential problems within our daily operations. Additionally, you have a proven track record in quality management, process improvement, and possess industry-specific knowledge. Your ability to collaborate and work cross-functionally, leveraging your industry-specific expertise, will enable you to implement effective solutions, making a significant impact on our company's operational excellence. \nSUCCESS LOOKS LIKE\n\nSupporting quality assurance for our FinanceBuzz and All About Cookies domains\nMaintaining the currently implemented process for building, setting up, and testing tracking URLs across all campaigns and platforms to ensure the highest quality\nReconciling reporting between our internal tracking platforms and external client platforms to ensure proper tracking\nConducting investigations when there is an offer discrepancy or malfunction and finding suitable resolutions\nReviewing platform documentation and internal product setup to find areas of improvement and working with the Operations team to determine next steps to close the gap\nWorking closely with the Operations team to ensure QA standards are consistently met\nCommunicating with internal stakeholders on process improvements\nAnalyzing ad hoc performance reports to improve company efficiency of revenue delivery, product improvement, or general site issues\nMonitoring revenue, conversions, impressions, and clicks to ensure proper reporting when a new offer is created, links are changed, or in other necessary circumstances\nMonitoring offer goals to ensure all goals are firing properly after creation\nEnsuring QA is successfully implemented with any new process that is rolled out\nQuickly becoming a subject matter expert for all QA related processes\n\nWHAT YOU NEED TO SUCCEED\n\n2-3 years in operations or quality assurance and expertise in digital media advertising \nExceptional attention to detail\nAbility to thrive in a fast-paced environment\nUnderstanding of Postback URL tracking and other performance marketing methods of tracking\nExperience with Tune & Yieldspark or similar tracking tools\nExperience with Asana or other project management tools\nExperience with Looker or similar BI tools like Tableau or PowerBI\nProven abilities to analyze performance reports to improve company efficiency of revenue delivery, product improvement, or general site issues\nProven problem solving abilities and #ownoutcomes mindset\nYou are proactive and will search for opportunities, not just being given tasks/tickets\nExcellent organizational and communication skills\nFluent in English, both written and verbal\nAbility to work East Coast hours consistently\n\n\nWant to make your impact in a profitable, high-growth company? Apply now!\nSince day one, we've been committed to having a diverse, inclusive team and culture. We are proud to be an Equal Employment Opportunity company. We value diversity, equity, and inclusion. \nWe do not discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\n\n"},{"id":344,"posted_on":"2024-11-28","company":"Rackspace","company_logo":"https://remotive.com/job/1953371/logo","position":"DEVOP Engineer","category":"DevOps / Sysadmin","tags":"{AWS,python,CI/CD,terraform}","salary":"","location":"India","apply_url":"https://remotive.com/remote-jobs/devops/devop-engineer-1953371","description":"Key ResponsibilitiesAutomate deployments utilizing custom templates and modules for customer environments on AWS. Architect AWS environment  best practices and deployment methodologies.Create automation tools and processes to improve day to day functions.Educate customers on AWS and Rackspace best practices and architecture.Ensure the control, integrity, and accessibility of the cloud environment for the enterprise Lead Workload/Workforce Management and Optimization related tasks.Assist Rackers across the Cloud Function. Technical ExpertiseExperienced in solutioning and implementation of Green field projects leveraging IaaS, PaaS for Primary site and DR.Near expert knowledge of AWS Products & Services, Compute, Storage, Security, networking, etc. Proficient skills in at least one of the following languages: Python, Linux, Shell scripting.Proficient skills with git and git workflows.Excellent working knowledge of Windows or Linux operating systems – experience of supporting and troubleshooting issues and performance.Highly skilled in Terraform/IaC, including CI/CD practices.Working knowledge in Kubernetes.Experience in designing, building, implementing, analysing, Migrating and troubleshooting highly available systems.Knowledge of at least one configuration management system such as Chef, Ansible, Puppet or any other such tools.Understanding of services and protocols, configuration, management, and troubleshooting of hosting environments, including web servers, databases, caching, and database services.Knowledge in the application of current and emerging network software and hardware technology and protocols.SkillsPassionate about technology and has a desire to constantly expand technical knowledge.Detail-oriented in documenting information and able to own customer issues through resolution.Able to handle multiple tasks and prioritize work under pressure.Demonstrate sound problem-solving skills coupled with a desire to take on responsibility.Strong written and verbal communication skills, both highly technical and non-technical.Ability to communicate  technical issues to nontechnical and technical audiences. EducationRequired Bachelor’s degree in Computer Science or equivalent degree. CertificationsRequires Associate level Certificates in AWS or professional level certificate. Experience5- 8 Years of total IT experience5 -8  Years. Of experience on AWS Cloud & Devops tools. Physical DemandsMay require work on non-traditional shifts. Should be able to work in 24*7 environments.A willingness to work weekends and/or holidays when required as the business dictates. About Rackspace TechnologyWe are the multicloud solutions experts. We combine our expertise with the world’s leading technologies — across applications, data and security — to deliver end-to-end solutions. We have a proven record of advising customers based on their business challenges, designing solutions that scale, building and managing those solutions, and optimizing returns into the future. Named a best place to work, year after year according to Fortune, Forbes and Glassdoor, we attract and develop world-class talent. Join us on our mission to embrace technology, empower customers and deliver the future.  More on Rackspace TechnologyThough we’re all different, Rackers thrive through our connection to a central goal: to be a valued member of a winning team on an inspiring mission. We bring our whole selves to work every day. And we embrace the notion that unique perspectives fuel innovation and enable us to best serve our customers and communities around the globe. We welcome you to apply today and want you to know that we are committed to offering equal employment opportunity without regard to age, color, disability, gender reassignment or identity or expression, genetic information, marital or civil partner status, pregnancy or maternity status, military or veteran status, nationality, ethnic or national origin, race, religion or belief, sexual orientation, or any legally protected characteristic. If you have a disability or special need that requires accommodation, please let us know."},{"id":345,"posted_on":"2024-11-28","company":"Hike","company_logo":"https://remotive.com/job/1953366/logo","position":"Business Analyst","category":"Data Analysis","tags":"{python,sql,\"google analytics\",tableau,\"A/B Testing\"}","salary":"","location":"India","apply_url":"https://remotive.com/remote-jobs/data/business-analyst-1953366","description":"At Hike, we’re building the Rush Gaming Universe 🎮 📲 💰To know more, check out work.hike.in.Hike Code 📝( Our core cultural values )The Hike Code is our value system. We aim to live and breathe by these every single day. They inspire us to be the best we can be and they are weaved into every part of our decision making, how we review performance and much more. We have 9 core values:  Top Talent in Every Role → Both a quest for greatness & shared values are important to us 🦸‍♂️  Owner not a Renter → Proactive & radically responsible. Everyone is an owner 🤝  Pro-Sports Team → Strength-based, results driven with a \"team-first\" attitude ⚽️  Customer Obsession → We exist to delight our customers 😃  Think Deeply & Exercise Good Judgement → Clear mind, obsession to simplify & data-informed 🙇‍♀️  Build & Make Magic → Courage to walk into the unknown and pioneer new fronts 🙀  Be Insatiably curious & keep Improving → Curiosity to acquire new perspectives, quickly 👨‍🏫  Move Fast & Be Dynamic→ Ruthless prioritization & move fast 🙋‍♂️  Dream Big, Be Bold & Think Long Term → Courage to climb big mountains 🚀 Skills & experience we're looking for 👨‍💻 You have a Bachelor’s degree in Math, Statistics, Comp Science, Engineering, or other technical field is a must; Advanced degrees will be preferred | Top talent in every role  You have a very good understanding of mobile and Internet products, growth strategies and business dynamics | Be Insatiably curious & keep Improving  You have 1-2 years experience performing quantitative analysis, preferably for an Internet or technology company | Top talent in every role  You have strong hands-on experience with SQL and Python I  Think Deeply & Exercise Good Judgement  You have strong hands-on knowledge of A/B testing and experimentation methodologies | Top talent in every role  You are comfortable manipulating, transforming, and analyzing complex, high-volume, high-dimensional data from varying sources. Experience with querying massive scale data with BigQuery is preferred I  Think Deeply & Exercise Good Judgement  You have experience in reporting and dash-boarding with tools like Tableau, Google Analytics etc I Top talent in every role  You have good understanding of statistical analysis, data warehousing, data modelling I Be Insatiably curious & keep Improving  You have proven ability to work in a fast-paced environment, meet changing deadlines and priorities on multiple simultaneous projects I  Move Fast & Be Dynamic  You have excellent organizational, communication, presentation and interpersonal skills I Top talent in every role You enjoy working in both individual and team settings | Pro-Sports Team  You will be responsible for 📲  Strategy → Continuously turn business questions into data analysis to make data & evidence based decisions and crucial business recommendations.  Strategy → Plan and execute A/B tests to optimize website, email, and other digital marketing channels to improve conversion rates and customer engagement.  Strategy → Conduct competitive analysis to identify strengths, weaknesses, and opportunities in the market to help inform our strategy.  Operations → Create visual displays of quantitative information to deliver effective presentations of findings and recommendations to multiple levels of leadership, develop and automate reports, iteratively build and prototype dashboards to provide insights at scale, solving for analytical needs.  Collaboration → Collaborate with cross-functional partners to understand their business needs, formulate and complete end-to-end analysis that includes data gathering, analysis, ongoing scaled deliverables and presentations.  Strategy → Have experimentation at the core of what you do. You own and evangelize data-driven experimentation in the team to improve the product offerings and document it. 💰 Benefits → We have tremendous benefits & perks. Check out work.hike.in to know moAbout the companyAt Hike, we’re building the Rush Gaming Universe. We're taking gaming, one of the fastest-growing segments of entertainment in India, and converting it into a brand new source of economic opportunity. We're building a new kind of game economy where players can play, earn & grow and become true owners in the very networks that they help create. Hike’s latest round of funding came in August 2021, where we raised capital from the world’s best product innovators & investors. The round was led by Justin Mateen (Co-Founder, Tinder). Rajeev Misra (CEO, SoftBank Vision Fund), Sean Rad (Co-Founder, Tinder), Arjun Sethi (Co-Founder & Partner, Tribe Capital), Bhavin Turakhia (Co-Founder, Zeta & Titan), Kunal Shah (Founder, Cred), Binny Bansal (Co-Founder, Flipkart), Aditya Agarwal (Partner in Residence, South Park Commons), Kunal Bahl (Co-Founder & CEO, Snapdeal) & Rohit Kumar Bansal (Co-Founder, Snapdeal), also participated in the round.Currently, our dedicated team comprises approximately ~160 professionals who work remotely from over 30 different cities. The way we see it is we’ve been dropped off on a mountain that’s unexplored, without a map and it’s our job to figure things out. It’s an opportunity of a lifetime, a chance to do our life's best work."},{"id":346,"posted_on":"2024-11-28","company":"Jobandtalent","company_logo":"https://remotive.com/job/1953314/logo","position":"Product Designer","category":"Design","tags":"{Figma,sketch,prototyping}","salary":"competitive salary and benefits","location":"EMEA","apply_url":"https://remotive.com/remote-jobs/design/product-designer-1953314","description":"The position\n \nAt Job&Talent we manage more than 40,000 active workers every day, we hire and provide work to thousands of new workers every week. They depend on us for one of the most important things in their lives: Being able to work and being paid for it\nWe're looking for a talented Product Designer to help turn our mission from vision to reality, working from the beginning to the end of product building, from new disruptive ideas to detailed iterations on micro-interactions.\n \nGreat product design allows us to fulfil our mission of fixing the user experience in the staffing world. At Job&Talent, you'll bridge the gap between technology and humans by working on small teams to design our product and come together to further our design language.\n\nResponsibilities\n\nWork through design problems from beginning to end: translating research insights into ideas that form products and features, then designing the workflows and detailed interactions to realize them\nSketch and prototype ideas to quickly access viability, and design the fine-grained details of interactions\nIterate based on feedback from the whole teamWork closely with engineers, product managers and leadership, defining together the solution, and supporting during development and launch\nOwn the success or failure of their design work and initiate design and engineering sprints to improve shipped work\nWrite about, present, and share what they have learned\nDesign, maintain and work within Jobandtalent's design system\nContribute proactively to identify improvement opportunities in the way we work (processes, tools, ceremonies, etc) \n\n\nYou have\n\nExperience designing digital products and systems, not just websites. You have helped ship products\nExperience designing experiences that people can access on any type of device: desktop, tablet, phone\nAn appreciation of the entire product development process, from problem-solving through to detailed UI and visual design\nThe ability to create high-fidelity mockups of your designs using Sketch, Figma, etc\nThe ability to create prototypes\nExcellent communicator of design work and your rationale behind proposals\nExcellent self-starter who can deeply collaborate with engineers\nDeep knowledge of UX/UI patterns\nSolid understanding of product design and development life cycle\nBeing a great communicator in English (Spanish highly desired)\n\nWhat we’re about\n \nAt Job&Talent, we're revolutionising the employment market globally. Our mission is simple and clear. We’re empowering the people who do essential work - from delivery drivers and warehouse workers, to cooks and cleaners - to get work and get paid on their terms. \n \nWe match these people with companies we’ve verified through our powerful tech platform. Apps, AI, web-based tools, innovative matching solutions and more. We create seriously smart technology, made for humans, by humans. \nAnd the numbers show we're doing things right. 340,000 people got work with over 2,500 companies globally last year, with clients spanning industries from logistics to retail, hospitality and more. We generated €1.9 billion in revenue in 2022. And we’re grateful to our top tier investors at Atomico, Kinnevik and Softbank.\n \nWe're headquartered in sunny Madrid, but we're a remote-first company operating in 10 countries across Europe, the United States and Latin America.\n \nBut there’s a missing piece. You.\n \nJoin our community\n \nIf you’re looking for a company that values innovation, high standards and data, you’ve found it. We’re also good listeners, because everyone’s voice is heard at Job&Talent. These values help us make good decisions and keep momentum. That’s how we operate. Standard.\n \nWhen it comes to our people, we’re all uniquely different. And it’s that difference that makes us stronger.\n \nWe encourage everyone to bring their true selves to work. Being real and empathic means we can build better products, services and workplaces for our workers and our clients. And dare we say it, we think that makes us all happier humans.\n \nWhat’s in it for you\n \nWe're building the world’s leading digital marketplace for essential work. You’ll hear 10x experience, AI, technology and human-centred design quite a lot. We strive for that across the entire company, from finance, to supply, to product.\n \nMake an impact through extreme ownership of the work you do. You create something and you help drive it forward. At Job&Talent, you’ll make an impact across borders with cross-functional teams, wherever you are.\n \nBe rewarded financially. It’s ingrained into our company philosophy. We offer our employees competitive salaries and benefits. Our Talent team can tell you a lot more about the perks in your region.\n \nGrow professionally by doing, not just watching or talking. We’re completely hands-on and we’re bootstrappers, making the most of our resources. And don’t be surprised to find yourself on a call with one of our founders. They like the details as much as the big picture.\n \nProud to champion equality\n \nAt Job&Talent we value diversity and we're an Equal Opportunities employer. We welcome applications from all suitably qualified people regardless of national origin, race, disability, religious beliefs or sexual orientation. Come join us. We look forward to your application.\n"},{"id":347,"posted_on":"2024-11-28","company":"Gomotive","company_logo":"https://remotive.com/job/1953895/logo","position":"Area Vice President, Enterprise East Sales","category":"Sales / Business","tags":"{\"saas sales\"}","salary":"$425,000 - $500,000 usd","location":"USA","apply_url":"https://remotive.com/remote-jobs/sales-business/area-vice-president-enterprise-east-sales-1953895","description":"Who we are:\nMotive empowers the people who run physical operations with tools to make their work safer, more productive, and more profitable. For the first time ever, safety, operations and finance teams can manage their drivers, vehicles, equipment, and fleet related spend in a single system. Combined with industry leading AI, the Motive platform gives you complete visibility and control, and significantly reduces manual workloads by automating and simplifying tasks.\nMotive serves more than 120,000 customers – from Fortune 500 enterprises to small businesses – across a wide range of industries, including transportation and logistics, construction, energy, field service, manufacturing, agriculture, food and beverage, retail, and the public sector.\nVisit gomotive.com to learn more.About the Role:\nAs an Area Vice President, Enterprise East Sales at Motive, you will be a key leader in our fastest growing segment at Motive. As a 2nd line leader in our Enterprise Sales org, you would manage a team of Regional Directors and guide them as their teams turn Motive’s largest prospects into customers. You’ll lead initiatives across hiring, go to market strategy, territory planning and enablement to lead Motive’s Enterprise sales teams to success. You will be at the center of it all, working directly with AEs, RVPs, cross functional teams, and Motive’s Executive team. \nOur Enterprise Sales team sells consistently into Fortune 500 companies across multiple industries, including trucking, oil & gas, construction, agriculture, manufacturing, consumer transit, or any other business that requires a fleet of vehicles. Because of the collaborative nature of our Go-to-Market team, a win-as-a-team mentality is a must. In this high-energy role, you should be comfortable working in a fast-paced environment with high standards of quality. \nWhat You'll Do:\n\nLead a world-class team of seasoned Regional Directors and the Account Executives on their teams, that you’ll partner with on forecasting, GTM strategy, territory planning, account planning, and achieving revenue targets\nDevelop and execute on strategic account and territory plans for the teams under your purview to meet or exceed ACV targets over monthly, quarterly, and annual periods\nYou are a builder and understand the correct balance of process and speed \nTrack progress and success of your teams leading indicator KPIs, coaching and enabling their success across short and long-term goals\nPartner with C-suite, Executive leadership, and Leaders of their own respective teams to enhance alignment and help create an GTM team that is greater than the sum of its parts \nCultivate a culture of high-performance, winning, fun, and accountability through best-in-class hiring \nPartner with our Sales Enablement team ad-hoc and on more formal Account Executive training and coaching programs to ensure consistency and effectiveness across the organization\nExcellence in listening, sales process and passionate about the art of selling\nEnsure use of CRM and other operational tools, processes, and best practices in pipeline planning, forecasting, and sales execution\n\n\nWhat We're Looking For:\n\n2+ years experience as a 2nd line leader of a SaaS sales team at the Enterprise level \n5+ years experience as a 1st line leader, managing SaaS sales teams at the Enterprise level\nHistory of exceeding sales targets with Enterprise-level clients\nAbility to lead and motivate others to action, including best-in-class customer skills communication, empathy, and integrity\nA people-based mindset, with a passion for coaching and developing sales talent at all levels and a history of developing great sales cultures\nExamples of bringing a great sense of rigor, executions and accountability to your team’s day-to-day processes\nAbility to collaborate with internal cross-functional partners across Sales Development, Sales Engineering, Product, Marketing, Customer Success, Legal and Sales Ops\nExperience with Salesforce or other CRM and sales technologies and best practices enabling your team to forecast, manage their pipeline and accelerate wins\nLead with curiosity and example by attending sales calls to help team manage and close deals\nMust live in Eastern United States - in region.\n\n\n    Pay TransparencyYour compensation may be based on several factors, including education, work experience, and certifications. For certain roles, total compensation may include restricted stock units. Motive offers benefits including health, pharmacy, optical and dental care benefits, paid time off, sick time off, short term and long term disability coverage, life insurance as well as 401k contribution (all benefits are subject to eligibility requirements). Learn more about our benefits by visiting Motive Perks & Benefits.The compensation range for this position will depend on where you reside. For this role, the on-target earnings (base pay + commissions) are:United States$425,000—$500,000 USDCreating a diverse and inclusive workplace is one of Motive's core values. We are an equal opportunity employer and welcome people of different backgrounds, experiences, abilities and perspectives. \nPlease review our Candidate Privacy Notice here.\nThe applicant must be authorized to receive and access those commodities and technologies controlled under U.S. Export Administration Regulations. It is Motive's policy to require that employees be authorized to receive access to Motive products and technology. \n#LI-Remote"},{"id":348,"posted_on":"2024-11-28","company":"Verra Mobility","company_logo":"https://remotive.com/job/1953315/logo","position":"UX/UI Designer","category":"Design","tags":"{Figma,\"Interaction Design\",prototyping}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/design/ux-ui-designer-1953315","description":" \n\n\n\n \n\n\n\nWho we are... \nVerra Mobility is a global leader in smart mobility. We develop technology-enabled solutions that help the world move safely and easily. We are fostering the development of safe cities, working with police departments and municipalities to install over 4,000 red-light, speed, and school bus stop arm safety cameras across North America. We are also creating smart roadways, serving the world's largest commercial fleets and rental car companies to manage tolling transactions and violations for over 8.5 million vehicles. And we are a leading provider of connected systems, processing nearly 165 million transactions each year across 50+ individual tolling authorities. \nCulture \nVerra Mobility Corporation is a rapidly-growing, entrepreneurial company that operates with a people-first philosophy and approach. The company lives by its core values—Do What’s Right, Lead with Grace, Win Together, and Own It—in everything it does for its customers and team members. The company seeks to grow aggressively, both organically and through acquisition, to continue to be the undisputed market leader with these five core competencies: bias for action, customer focus, teamwork, drive for results, and commitment to excellence. \nPosition Overview: \nAs a UI/UX Designer on the New Product Introduction (NPI) team within the Government Solutions business, you will play a pivotal role in defining the user experience for our customer-facing digital products including our cloud-based Back Office system. This role encompasses the full spectrum of user-centered design, from in-depth research and conceptualization to high-fidelity interface design and implementation. You will lead the entire design process, leveraging user insights to develop intuitive, innovative, and visually compelling interfaces that meet both user needs and business objectives. Working closely with product managers, engineers, cross-functional teams, and customers, you will transform complex user requirements into seamless, engaging digital experiences that drive user satisfaction and product success. \nJob Responsibilities: \n\nLead the end-to-end UX design process from start to finish, from initial user research and early sketching through final pixel-perfect Figma files and hand-offs for implementation \n\n\nConduct user research and usability testing to gather insights and identify areas for improvement \n\n\nCreate detailed design artifacts, including user flows and customer journey maps, wireframes, prototypes, low and high-fidelity designs, and responsive layouts that work across multiple device types and screen sizes \n\n\nDesign and maintain a robust design system with consistent visual elements, UI component libraries, and style guides \n\n\nPartner closely with Product Managers to identify product opportunities and refine detailed product requirements \n\n\nParticipate in brainstorming sessions and provide creative input to enhance product design and functionality \n\n\nWork intimately with engineering teams to ensure accurate implementation of designs \n\n\nCollaborate with cross-functional teams to ensure designs are feasible and align with business objectives, and quickly iterate based on feedback \n\n\nChampion user-centered design principles across the organization and contribute to the development of design guidelines, best practices, and standards \n\n\nStay at the forefront of UX/UI design trends, technologies, and best practices \n\n\nProvide support in areas of brand and visual design, ensuring consistency across various digital platforms \n\n \nMinimum Qualifications: \n\nBachelor's degree in Design, Human-Computer Interaction, User Experience Design or a related field \n\n\nMinimum of 3 years of experience in UI/UX design, with a focus on interaction design and prototyping \n\n\nProficiency in design and prototyping tools such as Figma, or similar \n\n\nExperience or strong enthusiasm for 0 to 1 product development, including comfort working in undefined or rapidly evolving contexts \n\n\nStrong portfolio demonstrating experience in designing user interfaces and interactive prototypes \n\n\nExperience with user research, usability testing, and translating insights into design improvements \n\n\nBasic understanding of HTML, CSS, and JavaScript, and the ability to work closely with software engineers \n\n\nStrong problem-solving skills and attention to detail \n\n\nExcellent verbal and written communication skills \n\n\nAbility to work effectively in a team and independently \n\n\nKnowledge of current UX design trends and technologies \n\n\nPosition requires occasional travel to engage with users and participate in team meetings (approx 20% of time) \n \nThis position is not eligible for visa sponsorship at this time \n\n\n\nVerra Mobility ValuesAn ideal candidate for this role naturally works in alignment with the Verra Mobility Core Values:\n\nOwn It. We focus on high performance and drive toward breakthrough outcomes. Our employees ensure accountability, optimize and align work, focus on the customer, and cultivate innovation.\nDo What’s Right. We champion integrity and good character. Our team members model ethical behavior, demonstrate good judgment and are courageous.\nLead with Grace. We express humility and compassion, and we are authentic and candid. Our employees demonstrate self-awareness, care for others, instill trust, and communicate effectively.\nWin Together. We believe in growing and inspiring people together. We seek people who collaborate, value differences, think and act globally, foster an engaging work environment, and recognize and develop others.\n\n \nWith your explicit consent which you provided as part of the application process, we will retain candidate personal data solely for the business purpose for which it was collected. In no event will we retain such data more than two (2) years following the closure of the recruitment process relating to the role for which you applied or in the event other related job opportunities arise within the company. Verra Mobility Applicant Privacy Notice\nVerra Mobility is an Equal Opportunity Employer, qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. \n\n\n\n \nVerra Mobility ValuesAn ideal candidate for this role naturally works in alignment with the Verra Mobility Core Values:\n\nOwn It. We focus on high performance and drive toward breakthrough outcomes. Our employees ensure accountability, optimize and align work, focus on the customer, and cultivate innovation.\nDo What’s Right. We champion integrity and good character. Our team members model ethical behavior, demonstrate good judgment and are courageous.\nLead with Grace. We express humility and compassion, and we are authentic and candid. Our employees demonstrate self-awareness, care for others, instill trust, and communicate effectively.\nWin Together. We believe in growing and inspiring people together. We seek people who collaborate, value differences, think and act globally, foster an engaging work environment, and recognize and develop others.\n\n \nWith your explicit consent which you provided as part of the application process, we will retain candidate personal data solely for the business purpose for which it was collected. In no event will we retain such data more than two (2) years following the closure of the recruitment process relating to the role for which you applied or in the event other related job opportunities arise within the company. Verra Mobility Applicant Privacy Notice\nVerra Mobility is an Equal Opportunity Employer, qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. \n\n\n\n\n\n"},{"id":349,"posted_on":"2024-11-28","company":"Blackpoint Cyber","company_logo":"https://remotive.com/job/1953303/logo","position":"Tier 1 Technical Support Engineer","category":"Customer Service","tags":"{\"technical support\"}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/customer-support/tier-1-technical-support-engineer-1953303","description":"Blackpoint Cyber is the leading provider of world-class cybersecurity threat hunting, detection and remediation technology. Founded by former National Security Agency (NSA) cyber operations experts who applied their learnings to bring national security-grade technology solutions to commercial customers around the world, Blackpoint Cyber is in hyper-growth mode,  fueled by a recent $190m series C round. What You'll Do: We are seeking a Tier 1 Support Engineer to serve as the frontline of our technical support team. Your primary responsibility will be addressing incoming support tickets and answering customer phone calls, ensuring that every customer interaction is handled with care and professionalism. This role is ideal for individuals passionate about delivering exceptional customer service, solving straightforward technical issues, and ensuring customer satisfaction in a fast-paced environment. If you enjoy troubleshooting and are eager to grow your skills in technical support, we want you on our team!  Responsibilities and Expectations: Monitor and respond to incoming support tickets. Provide first-line assistance to customers via phone, email, or chat, ensuring timely and accurate resolution of inquiries. Troubleshoot common technical issues, including basic software configurations, account setup, and connectivity issues. Escalate complex or unresolved issues to Tier 2 or Tier 3 engineers with detailed notes and troubleshooting steps taken. Ensure excellent customer service by following up on open tickets, ensuring resolution, and maintaining clear communication with customers. Document resolutions and contribute to the team knowledge base to improve efficiency and support consistency. Maintain a strong understanding of company products, services, and standard operating procedures. Participate in training sessions to enhance technical knowledge and customer service skills.  Key Skills and Experience: 2+ years of experience in a Technical Support role (or equivalent). Familiarity with ticketing systems like Zendesk or similar platforms. Basic understanding of common IT concepts, including: Operating systems (Windows, Linux, and macOS). Networking basics (IP addressing, VLANs, DNS, DHCP, firewalls, etc.). Software installations and basic configurations. Strong problem-solving skills and attention to detail. Excellent written and verbal communication skills, able to explain technical concepts to non-technical customers effectively. Ability to handle multiple tasks simultaneously in a fast-paced environment.  Desired Soft Skills: Friendly, customer-focused attitude with a commitment to solving customer problems efficiently. Strong organizational skills and time management. Team-oriented mindset with a willingness to collaborate and learn from peers. Calm and patient demeanor when handling frustrated or confused customers. Enthusiasm for learning new technologies and support tools.  Benefits of Joining Our Team: Work with cutting-edge technology in a collaborative and innovative environment. Opportunities for career growth and development. A culture that values customer-centric thinking and continuous improvement. Blackpoint Cyber welcomes and encourages applications from qualified individuals of all races,  colors, religions, sex, sexual orientation, gender identity or expression, national origin, age, marital  status, or any other legally protected status. We are committed to equality of opportunity in all  aspects of employment.  For eligible employees in the US, Blackpoint offers competitive Health, Vision, Dental, and Life Insurance plans, a robust 401k plan, Discretionary Time Off, and other minor perks."},{"id":350,"posted_on":"2024-11-28","company":"Lucidworks","company_logo":"https://remotive.com/job/1953304/logo","position":"Search Engineer, Technical Support","category":"Customer Service","tags":"{java,kubernetes,python}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/customer-support/search-engineer-technical-support-1953304","description":"Lucidworks is leading digital transformation for some of the world's biggest retailers, financial services firms, manufacturers, and B2B commerce organizations. We believe that the core to a great digital experience starts with search and browse. Our Deep Learning technology captures user behavior and utilizes machine learning to connect people with the products, content, and information they need. Brands including Crate & Barrel, Lenovo, Red Hat, and Cisco Systems rely on Lucidworks' suite of products to power commerce, customer service, and workplace applications that delight customers and empower employees. Lucidworks believes in the power of diversity and inclusion to help us do our best work. We are an Equal Opportunity employer and welcome talent across a full range of backgrounds, orientation, origin, and identity in an inclusive and non-discriminatory way.About the TeamThe technical support team leverages their extensive experience supporting large-scale Solr clusters and the Lucene/Solr ecosystem. Their day might include troubleshooting errors and attempting to fix or develop workarounds, diagnosing network and environmental issues, learning your customer's infrastructure and technologies, as well as reproducing bugs and opening Jira tickets for the engineering team. Their primary tasks are break/fix scenarios where the diagnostics quickly bring network assets back online and prevent future problems - which has a huge impact on our customers’ business. About the RoleWe’re looking for a support engineer with a wide range of technical abilities to communicate with customers to gather data about the problems they are facing, as well as working with the engineering team and vendors to perform root cause analysis (RCA) and, ultimately, resolutions. This means continuous contact with the customer and a high level of attentiveness to their needs and priorities. This role balances technical depth with empathy for the customer’s needs and a drive to continually improve the products and ensure an excellent customer experience. You are the first line in our Customer Success team to help our users.  This role will provide primary support to our U.S. government customers.About YouYou are a curious-minded, natural problem solver who plays well with others and cares about the work, the team, and the customers. You are able to work collaboratively with a diverse community of personalities spread across multiple time zones, leveraging your excellent communication skills to make sure everyone is on the same page.  You leverage all of your technical and people skills to become a trusted advisor for your customers and peers, both internal and external.Our Stack:Apache Lucene/Solr, ZooKeeper, Spark, and PulsarJava, Python, Linux, KubernetesZendesk, JiraThis is a remote role and will remain remote.This role is expected to participate in weekend on-call rotations.Responsibilities Field incoming questions, help users configure Lucidworks Fusion and its components, and help them to understand how to use the features of the productTroubleshoot complex search issues in and around Lucene/SolrDocument solutions into knowledge base articles for use by our customer base in our knowledge centerIdentify opportunities to provide customers with additional value through follow-on products and/or servicesCommunicate high-value use cases and customer feedback to our Product Development and Engineering teamsCollaborate across teams internally to diagnose and resolve critical issuesParticipating in a 24/7/365 on-call rotation, which includes weekends and holidays shiftsYou have: US Citizenship required due to government contractsExperience with Search technologies such as Apache Lucene/Solr or other search technologies like ElasticBS or higher in Engineering or Computer Science is preferred 3+ years professional experience in a customer facing level 2-3 tech support roleExperience with technical support CRM systems (Salesforce, Zendesk etc.)Ability to clearly communicate with customers by email and phoneProficiency with Java and one or more common scripting languages (Python, Perl, Ruby, etc.)Proficiency with Unix/Linux systems (command line navigation, file system permissions, system logs and administration, scripting, networking, etc.)Exposure to other related open source projects (Mahout, Hadoop, Tika, etc.) and commercial search technologiesEnterprise Search, eCommerce, and/or Business Intelligence experienceKnowledge of data science and machine learning conceptsExperience with cloud computing platforms (GCP, Azure, AWS, etc.) and KubernetesStartup experienceOur StackApache Lucene/Solr, ZooKeeper, Spark, Pulsar, Kafka, GrafanaJava, Python, Linux, KubernetesZendesk, JiraLucidworks believes in the power of diversity and inclusion to help us do our best work. We are an Equal Opportunity employer and welcome talent across a full range of backgrounds, orientation, origin, and identity in an inclusive and non-discriminatory way. Applicants receive consideration based on the relevant talents, skills, and experiences they offer to our company. Thank you for your interest and we look forward to learning more about you.Note to third party recruiters: We appreciate your interest in our job opportunities. However, we kindly request that third-party recruiters and staffing agencies refrain from contacting us regarding these positions. We prefer to work directly with candidates and do not accept unsolicited resumes or candidate referrals from third-party recruiters or agencies. Unsolicited resumes and referrals will become the property of Lucidworks, and no fee will be paid should we hire a candidate whose resume was sent unsolicited."},{"id":351,"posted_on":"2024-11-28","company":"Proxify","company_logo":"https://remotive.com/job/1606658/logo","position":"Senior Next.js Developer","category":"Software Development","tags":"{C,C#,unity,unity3D,\"Typescript \",scripting,troubleshooting,testing}","salary":"$40k - $75k","location":"CET +/- 3 HOURS","apply_url":"https://remotive.com/remote-jobs/software-dev/senior-next-js-developer-1606658","description":"The Role:\nWe are looking for a Senior Next.js Developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\nWhat we’re looking for:\n\n\n5+ years of experience in web development, with at least 4 years equally using both React and Next.js.\n\n\nProficient understanding of web markup, including HTML5 and CSS3.\n\n\nStrong experience with server-side rendering and static site generation in Next.js.\n\n\nFamiliarity with RESTful APIs and modern authorization mechanisms, such as JSON Web Token.\n\n\nExperience with state management libraries (e.g., Redux, MobX).\n\n\nFamiliarity with modern front-end build pipelines and tools.\n\n\nExperience with data structure libraries (e.g., Immutable.js) is a plus.\n\n\nExcellent troubleshooting and communication skills.\n\n\nResponsibilities:\n \n\n\nLead the development of new user-facing features using Next.js.\n\n\nOptimise applications for maximum speed and scalability.\n\n\nEnsure the technical feasibility of UI/UX designs.\n\n\nCollaborate with back-end developers and web designers to improve usability.\n\n\nWrite robust, clean, and documented code.\n\n\nMaintain and enhance existing web applications.\n\n\nConduct performance tests and ensure responsiveness and stability across all platforms.\n\n\n \n \n \nWhat we offer:\n \n\nGet paid, not played\n\n\nNo more unreliable clients. Enjoy on-time monthly payments with flexible withdrawal options.\n\n\nPredictable project hours\nEnjoy a harmonious work-life balance with consistent 8-hour working days with clients.\nFlex days, so you can recharge\nEnjoy up to 24 flex days off per year without losing pay, for full-time positions found through Proxify.\nCareer-accelerating positions at cutting-edge companies\nDiscover exclusive long-term remote positions at the world's most exciting companies.\nHand-picked opportunities just for you\nSkip the typical recruitment roadblocks and biases with personally matched positions.\nOne seamless process, multiple opportunities\nA one-time contracting process for endless opportunities, with no extra assessments.\n\n\nCompensation\nEnjoy the same pay, every month with positions landed through Proxify.\n\n"},{"id":352,"posted_on":"2024-11-28","company":"Wunderman Thompson","company_logo":"https://remotive.com/job/1953409/logo","position":"Senior Medical Writer","category":"Writing","tags":"{CX,CRM,mentoring,\"MS Office\"}","salary":"","location":"Europe, UK","apply_url":"https://remotive.com/remote-jobs/writing/senior-medical-writer-1953409","description":"Who We Are:\nAt VML, we are a beacon of innovation and growth in an ever-evolving world. Our heritage is built upon a century of combined expertise, where creativity meets technology, and diverse perspectives ignite inspiration. With the merger of VMLY&R and Wunderman Thompson, we have forged a new path as a growth partner that is part creative agency, part consultancy, and part technology powerhouse. \nOur global family now encompasses over 30,000 employees across 150+ offices in 64 markets, each contributing to a culture that values connection, belonging, and the power of differences.  Our expertise spans the entire customer journey, offering deep insights in communications, commerce, consultancy, CRM, CX, data, production, and technology. We deliver end-to-end solutions that result in revolutionary work. Senior Medical Writer – Med Ed / Med commsThis is a remote working position and can be based anywhere in the UK or Europe.\n \nESSENTIAL DUTIES AND RESPONSIBILITIES\n\nHands on development of a range of scientific/medical education materials such as educational slide decks, KOL presentations, and content for Ad Boards.\nLeading discussions on scientific content with clients and external experts (KOLs), both face to face (when necessary) and on calls.\nContributing to scientific strategy development to inform tactical planning of accounts, both internally and with clients.\nContributing to organic growth opportunities on accounts.\nContributing to scientific input for proposals for business growth\nMentoring and coaching of junior writers (may not always be relevant depending on size and composition of workstream team).\n\nEDUCATION and EXPERIENCE\n\nA degree in either Pharmacy, Medicine, Biomedical or Biological Sciences, or Health Sciences.\nA PhD or Postgraduate qualification in Biological Sciences or Biomedical Science would be useful but not essential.\n5+ years’ experience as a Snr Medical Writer within a medical education/medical communications agency. Knowledge of immunology highly desirable but other candidates will be considered.\nStrong grounding in Med Ed initiatives/ programmes + Scientific events content development\n\nSKILLS\n\nLevel of English: Native English speaker or fully fluent with degree/post-degree education conducted in English language.\nProficiency in MS Office Tools, especially Word and PowerPoint, also Adobe Acrobat Professional\nStrong communication skills, high emotional intelligence, the ability to adapt approach according to the needs of clients and teams, and the ability to respond rapidly to situations and manage internal/external issues.\nFamiliarity with organic growth and contributing to proposals and pitches.\nAbility to deliver materials for events and large educational programmes, and experience of digital projects.\nWorking knowledge of pharmaceutical regulations.\n\n At VML, we are committed to fostering an all-inclusive work environment that is both rewarding and career-forward. Our Inclusion, Equity & Belonging initiatives, alongside the VML Foundation, reflect our dedication to giving back and making a positive impact in our communities and beyond. Our people are the heartbeat of our organization—creators, doers, innovators, makers, and thinkers—who drive not just marketing, but meaningful experiences that resonate in every action and interaction. \nVML is a WPP Agency. For more information, please visit our website, and follow VML on our social channels via Instagram, LinkedIn, and X. \nWhen you click \"Submit Application\", this will send any information you add below to VML. Before you do this, we think it's a good idea to read through our Recruitment Privacy Policy. California residents should read our California Recruitment Privacy Notice. This explains what we do with your personal data when you apply for a role with us, and, how you can update the information you have provided us with or how to remove it."},{"id":353,"posted_on":"2024-11-28","company":"Facet","company_logo":"https://remotive.com/job/1953648/logo","position":"Financial Planner","category":"Finance / Legal","tags":"{\"time management\"}","salary":"$75,000-$85,000 base salary + bonus","location":"USA","apply_url":"https://remotive.com/remote-jobs/finance-legal/financial-planner-1953648","description":"As a Financial Planner at Facet, you will be a key player in helping our members receive incredible comprehensive financial planning. Your job is to provide continuity when a Senior Planner is unavailable by evaluating member situations and delivering on time and accurate advice. In this role, you will align with the Facet planning philosophy and apply your planning knowledge to member situations to provide a consistent member experience. We are looking for people who: Love helping people reach their financial goals and are passionate about providing an exceptional, high-quality member experience as part of a team Can quickly build trust and rapport with members and guide members to take action on unbiased recommendations that are in their best interest Are process-oriented, organized, highly adaptable, and not afraid of a little chaos Are comfortable consistently evaluating the financial plans for new members with the support of in-house tools Fully embrace technology and are able to thrive and build relationships in a remote environment Day-to-Day Responsibilities:Responsible for reviewing incoming member messages while Senior Planners are out on parental leave or out of the office to determine the urgency of the request and the best course of action. Efficiently synthesize members needs and then partner with team members to coordinate solutions. Step in and meet with members on an as needed basis to address their questions and deliver recommended next steps during their planner's absence.  Become an expert on our in house tools to assist planners with building plans. Guide our Foundations members through implementation of their plan by utilizing messaging and our in house tools to answer questions and inspire them to take action. Manage a small group of members as the sole planner, guiding them through the entire planning process and motivating them to take action on advice. Effectively and ruthlessly manage your calendar, time, and other tasks to ensure efficiency What makes this role different? As a financial planner, you… Learn from Senior Planners and further develop your approach to managing members Will be helping to disrupt a historically inaccessible industry and build the next great financial services company Will be providing unbiased, personalized, and affordable advice to your members Will work with cutting-edge proprietary technology built specifically to enhance the Facet Way of planning Will not be compensated on the amount of assets someone has managed with Facet Have the flexibility to live anywhere in the US Requirements CFP® designation 1+ years of member facing financial planning experience Effective follow up and typing/written communication skills Excellent interpersonal skills and ability to build connections with members  Exceptional time management and communication skills –these are the biggest keys to success as a Facet reserve planner Excellent computer skills and the ability to learn in-house software and tools Benefits $75,000-$85,000 base salary + bonus Equity  Flexible PTO  All the benefits: medical, dental, and vision insurance, 401(k) with employer match, short and long term disability coverage (paid by Facet), life insurance options and paid parental leave Certification reimbursement program  Work from anywhere in the US About the companyWe’re building a human-centric approach to financial planning – and opening up financial advice to an enormous market of underserved people. As one of the fastest-growing financial services companies, we’re looking for exceptional talent to bring our technology and service to millions of Americans. Are you ready for the most rewarding job of your life? "},{"id":354,"posted_on":"2024-11-28","company":"Stellar Health","company_logo":"https://remotive.com/job/1953307/logo","position":"Associate, Provider Success - Bilingual in Spanish","category":"Customer Service","tags":"{excel,security,\"product development\",analytics,healthcare,\"account management\",onboarding,chat,diversity,banking,travel,gsuite}","salary":"$63,000 - $80,000 plus quarterly performance bonus","location":"USA","apply_url":"https://remotive.com/remote-jobs/customer-support/associate-provider-success-bilingual-in-spanish-1953307","description":"About Stellar Health:\nHistorically, US Healthcare has relied on a fee-for-service reimbursement system where providers are paid based on the quantity of patient visits and procedures, rather than the quality of health outcomes. \nAt Stellar Health, we help primary care providers put patient health first. Our platform - a mix of technology, people, and analytics - supports providers at the point of care, delivering real-time patient information, activating practice staff, and empowering providers and care teams with incentives that reward the work they are already doing to keep patients healthy. Using the Stellar App, our web-based, point-of-care tool; practices receive a simple checklist of recommended actions that support the best quality care. Providers and care teams are then paid monthly for each action they complete, and Payors save money in reduced healthcare costs along the way.  \nStellar is a US-based Health-tech backed by Top VCs (General Atlantic, Point72, & Primary Venture Partners)​​ with an established product & proven operating model. We’ve shown that we make a real difference for physician practices and their patients.About the position:\nThe Provider Success Team works directly with primary care providers and Medical Groups who have opted into the Stellar Health Program. Provider Success Associates focus on driving engagement and performance outcomes with stakeholders. Associates work directly with practice staff and Medical Groups to ensure they are completing critical actions for patients both within the Stellar app and also for other aspects of the Stellar Program. This role requires that you act as a trusted, strategic partner to various end users, helping them prioritize across multiple workflows.\nWhat you’ll do:\n\nWork with a slate of Medical Groups and the providers, practice managers, and care team staff members who work at a Group to integrate the Stellar Health platform into a Group’s day to day workflows. \nWork with Provider Implementations to ensure a group is effectively onboarded and bought-in to the Stellar Program\nUse analytical tools and qualitative insights to assess practice performance over time and guide improvement on specific goals\nPartner closely with account management counterparts to align provider performance with key customer success metrics  \nTranslate in-depth understanding of provider and practice staff needs into critical insights for product development \nExecute on strategies to help providers engage more successfully with Stellar and deliver better outcomes\nAct as a Stellar Ambassador with clients and with other healthcare stakeholders\n\nWhat you need to have:\n\n1-2 years of professional experience in a healthcare oriented environment\nPrior experience in relationship management, sales, or customer success preferred\nDrive to succeed - sees problems and barriers as opportunities \nGreat interpersonal skills - communicates value clearly and persuasively\nAbility to build relationships and influence behaviors \nAbility to think strategically and and critically to solve tough problems\nCan glean insights and make decisions based on data \nStrong working knowledge of Excel \nPrior experience with GSuite or Office365 (familiar with modern tech stacks)\n\nWho will love this job:\n\nYou get things done and you love working in a dynamic environment; we move quickly and we need a teammate who will too\nYou thrive on helping others and owning successful outcomes\nYou are a team player and understand collaboration and accountability are key\nYou understand, appreciate and enjoy responsibility\nYou are excited by a challenge - you love solving tough problems and getting to the win\n\nPay:\nThe salary range for this role is $63,000 - $80,000 and will be eligible for a quarterly performance based bonus. Where a new hire falls within this range will be based on their individual skills and experience, and how these competencies compare across other employees in the same role. Stellar's bands are designed to allow for individual compensation growth within the role.  As such, new hires typically start at the lower end of the range.  Stellar rewards performance and outcomes - should you join the company, you will have the opportunity to grow your salary over time.\nStellar reserves the right to change our compensation bands at any time.Perks & Benefits:\nStellar offers a carefully curated selection of wellness benefits and perks to our employees:\n\nMedical, Dental and Vision Benefits\nUnlimited PTO\nUniversal Paid Family Leave\nCompany sponsored One Medical memberships and Citibike memberships\nMedical Travel Benefits \nA monthly wellness stipend that gives employees the freedom to choose where they spend their cash, whether it be on wellness, pet care, childcare, WFH items, or charitable donations\nStock Options & a 401k matching program\nCareer development opportunities like Manager Training, coaching, and an internal mobility program\nA broad calendar of company sponsored social events that for our in-office and remote employees\n\nDiversity is the key to our success. Stellar Health is an equal opportunity employer and we are open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, veteran status, or any other legally protected status.  \nWe believe that diverse teams -and the different identities, cultures, and life experiences our team members bring to the table- enable us to create amazing products, find creative solutions to interesting problems, and build an inclusive working environment. \nStellar Health Employment Privacy Notice\nAt Stellar Health, your privacy and security as a job seeker is a priority no matter where you are in the interview process. As recruiting scams have become more prevalent, please take note of the following practices to ensure the legitimacy of any interaction with our team. \n\nPlease note that any communication from our recruiters and hiring managers at Stellar Health about a job opportunity will only be made by a Stellar Health employee with an @stellar.health email address. \nStellar Health does not utilize third-party agencies for recruitment services and does not conduct text message or chat-based interviews. Any other email addresses, agencies, or forums may be phishing scams designed to obtain your personal information. \nWe will not ask you to provide personal or financial information, including, but not limited to, your social security number, online account passwords, credit card numbers, passport information, and other related banking information until we begin onboarding activities, which will be coordinated by a member of the Stellar Health People Ops Team with an @stellar.health email address.  \n\nIf you are ever unsure whether you are in contact with a legitimate Stellar Health teammate, please contact people-team@stellar.health. If you believe you've been a victim of a phishing attack, please mark the communication as “spam” and immediately report it by contacting the U.S. Federal Trade Commission."},{"id":355,"posted_on":"2024-11-28","company":"Everi","company_logo":"https://remotive.com/job/1953374/logo","position":"Manager Dev Ops","category":"DevOps / Sysadmin","tags":"{CI/CD,NoSQL}","salary":"$130,700 - $155,200 annually","location":"USA","apply_url":"https://remotive.com/remote-jobs/devops/manager-dev-ops-1953374","description":"Power the Casino Floor by joining the Enterprise Solutions Team at Everi.What Will You Be Doing? Monitor and approve DevOps PRs and change management Monitor Critical filesCoordinate with CloudOpsCoordinate with System Engineers Coordinate with OperationsUnderstand and help triage live supportKeep track of infrastructure usage and needsTrack and maintain cross-team accountability on major projects and priorities (TKG, Azure migration, R7, Security, Patching)Mentor team membersContinue to follow best practices and implement them across DevOps, pipelines, automation, etc Represent DevOps professionally to the rest of the companyManage and groom the Jira board and track priorities (hopefully with help from a PM)Work closely with Director of Software Development to understand priorities and relevant release datesSkills, Knowledge, & Expertise Needed for the Job:Bachelor’s Degree in Computer Science, Engineering, Information Systems, or a combination of  education and equivalent work experience in a related field required.8 -12 years experience in a system, network, and delivery role supporting a diverse, multi -platform, and data -driven environment.Experience with NoSQL databases.Experience leading a team or project. Experience with deployment and troubleshooting of complex microservice-driven applications.  In-depth experience managing one or more major information processing functions, including CI/CD. Advanced knowledge and practical application of computer science, software engineering, and software development practices, including agile software development, feature driven development, and SDLC.Proven ability to identify and perform root cause analysis of issues.Why Us?Everi’s benefits package includes Medical, Dental, Vision, 401k with company match, life insurance, maternity and paternity leave, adoption assistance, pet insurance, gym reimbursement, and more!Discretionary Time Off (DTO) - No more “banking hours” to take a day off and the perfect way to prevent burnout and improve productivity.Building on a solid culture and resounding positive feedback from Everi employees in 2021, Everi continued to receive recognition as a Top Workplace in 2022. Everi was recognized nationally as a Top Workplace 2022 USA and received a second regional award for its HQ in Las Vegas as a Nevada Top Workplace 2022. This most recent award brings Everi’s total number of Top Workplaces awards in 2021 and 2022 to a whopping 10 awards!!!!﻿﻿﻿﻿Everi is committed to expanding its innovative and creative reach, building a culture based on the tenets of respect and transparency. We are proud to be the gaming industry’s single-source provider of financial technology, loyalty solutions, games, and intelligence solutions. ﻿﻿The compensation for this role considers a wide range of factors, including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential for the location at which the position may ultimately be filled. At Everi, it is not typical for all individuals to be hired at or near the end of the range; compensation decisions depend on each case’s facts and circumstances. A reasonable estimate of the current range is $130, 700  - $ 155,200 annually.Everi is an Equal Opportunity Employer. All qualified applicants and employees will be afforded equal employment opportunities without discrimination because of race, creed, color, national origin, sex, age, disability, marital status, or any other characteristic or class protected by federal, state, or local law.** For All External Staffing Agencies **Everi does not accept unsolicited agency submittals. Please do not forward resumes to our Executive team, Management team, or any current Everi employee for review. Everi is not responsible for any fees related to unsolicited resumes.#LI- remote#LI-MW1"},{"id":356,"posted_on":"2024-11-28","company":"Aura798","company_logo":"https://remotive.com/job/1953897/logo","position":"Inside Sales Representative - Enrollment","category":"Sales / Business","tags":"{saas,salesforce,CRM,\"Inside Sales\"}","salary":"$60,000 - $75,000 annually","location":"USA","apply_url":"https://remotive.com/remote-jobs/sales-business/inside-sales-representative-enrollment-1953897","description":"Aura is on a mission to create a safer internet.  In a world where our lives are increasingly online, Aura's category-defining suite of intelligent digital safety products help millions of customers protect themselves against digital threats, and that number is growing rapidly.  This is an exciting phase at Aura, and our team of over 400 people worldwide is guided by a leadership slate that's successfully grown startups into multi-billion dollar organizations. \nCome build with us!\nAbout the Role:\nWe're looking for some hungry, ambitious candidates who want to take the next step in their SaaS career and get exposure being part of a Unicorn company in hyper-growth mode. This team will take inbound sales enrollment calls from prospective customers and align them to the Aura package that best fits their needs and the needs of their family and loved ones. So, NO OUTBOUND COLD CALLING!\nDay to Day:\n\n\nMaster evangelizing Aura's story and mission to “create a safer internet”  for individuals and families\n\n\nFull comprehension of Aura's product catalog and how they protect our customers\n\n\nConsult with customers on best practices to better protect their online identity and digital assets\n\n\nTake inbound sales calls generated by our marketing team and partners, and align those prospective customers with the Aura plan that best meets their needs \n\n\nAchieve or exceed monthly quotas by enrolling new customers prospects into Aura \n\n\nCollaborate with team members to better improve sales processes\n\n\nProactively improve knowledge of industry best practices and recent events to ensure you are a trusted resource customers\n\n\nWhat you bring to the table:\n\n\n1-2 years of sales experience (or equivalent experience) where you consistently meet/exceed performance metrics\n\n\nLove talking to people and are naturally engaging\n\n\nHave a high level of integrity and work ethic\n\n\nNaturally competitive and thrive within a fast-paced sales environment\n\n\nSelf motivated and know how to push yourself to achieve goals\n\n\nAre a team player and know how to win within a team environment\n\n\nHave working knowledge of internal CRM’s and Salesforce\n\n\nLike to work hard, have fun, laugh, and be a part of a winning team\n\n\nIt would be nice if you had:\n\n\nAptitude to learn new technology and systems\n\n\nInnovative thinker that likes to problem solve\n\n\nAura is committed to offering a generous package to support our employees in all aspects of their life in and out of work. Our packages offer competitive pay, generous health and wellness benefits, retirement savings plans, parental leave and much more! Pay range for this position is $16 - $18 per hour, plus commission. Total compensation (hourly rate + commission) is estimated to be $60,000 - $75,000 annually, but may vary depending on job-related knowledge, skills, experience and location.\n#LI-remoteAura is proud to be an equal employment workplace. All qualified applicants will be considered for employment without regard to, and will not be discriminated against based on race, color, ancestry, national origin, religion, age, sex, gender, marital status, sexual orientation, gender identity, disability status, veteran status, or any protected category. Beyond equal employment opportunity, Aura is committed to being an inclusive community where all feel welcome.\nAura is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please let your Talent Acquisition Partner know.\nImportant privacy information for United States based job applicants can be found here."},{"id":357,"posted_on":"2024-11-28","company":"Magicschool","company_logo":"https://remotive.com/job/1953596/logo","position":"Senior Software Engineer - Integrations","category":"Software Development","tags":"{node.js}","salary":"","location":"USA","apply_url":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-integrations-1953596","description":"WHO WE ARE: MagicSchool is the premier generative AI platform for teachers. We're just over a year old, and more than 3.5M teachers from all over the world have joined our platform. Join a top team at a fast growing company that is working towards real social impact. Make an account and try us out at our website and connect with our passionate community on our Wall of Love.Senior Software Engineer - Integrations (EdTech)Role Description: As an Integrations Engineer, you will enable seamless integrations between our platform and key partners, including Enterprise and Mid-Market customers. You will design and implement scalable API, SSO, and LTI solutions, troubleshoot technical challenges with internal and external customers, and create best-practice documentation for diverse stakeholders. This role combines hands-on engineering with strategic collaboration across teams to deliver world-class EdTech integrations.Responsibilities: In this role, you will be responsible for:Deliver Seamless API and LTI Integrations: Partner with customers to architect, implement, and validate scalable integrations using technologies like Node.js, OAuth 2.0, and RESTful APIs.Enhance Documentation and Standards: Develop clear, user-friendly best practices and technical documentation for API and SSO solutions, tailored for technical and non-technical audiences.Support and Troubleshoot: Collaborate with external partners and internal teams to address integration challenges, ensuring smooth implementation and communication.Build Proof-of-Concepts: Create prototypes and integration models to support pre-sales engagements and improve developer experience.Lead and Mentor: Guide teammates by sharing expertise, leading discussions, and mentoring others on best practices for integrations and engineering.Qualifications/Competencies/Skills:To be successful in this role, you bring:Strong expertise in API and LTI integrations, specifically with EdTech systems such as Clever, Canvas, Schoology, or Google Classroom.Proficient in building integrations using modern web development technologies (e.g., Node.js, Next.js, React, TypeScript, Serverless & Edge functions, PostgreSQL).In-depth experience integrating SSO technologies, including OAuth 2.0, OpenID, and related standards.Experience troubleshooting and supporting integrations for school systems, communicating effectively with both technical and non-technical stakeholders.Exceptional ability to translate technical concepts into user-friendly language for varied audiences.Familiarity with student information systems (e.g., PowerSchool, Blackboard) and their integration processes.Proven experience collaborating across teams and with external partners to deliver impactful technical solutions.Required Experience:5+ years of experience in software engineering, with a focus on API integrations or similar technical solutions.Proven track record of integrating third-party platforms and SSO solutions.Direct experience working with EdTech platforms, LMS, or SIS systems.Preferred Experience:Hands-on experience with Edlink or similar integration platforms.Product-facing expertise, especially in the EdTech or education domain.Leadership experience, including mentoring engineers and leading technical discussions.Passion for building scalable and secure integrations while contributing to a collaborative engineering culture.Experience working with subprocessors and managing complex technical back-and-forth.Startup experienceOur Benefits: We are proud to offer generous benefits, such as unlimited PTO, 100% employer covered health insurance, a wellness stipend, and vision/dental insurance.Our Values:Educators are Magic:  Educators are the most important ingredient in the educational process - they are the magic, not the AI. Trust them, empower them, and put them at the center of leading change in service of students and families.Joy and Magic: Bring joy and magic into every learning experience - push the boundaries of what’s possible with AI.Community:  Foster community that supports one another during a time of rapid technological change. Listen to them and serve their needs.Innovation:  The education system is outdated and in need of innovation and change - AI is an opportunity to bring equity, access, and serve the individual needs of students better than we ever have before.Responsibility: Put responsibility and safety at the forefront of the technological change that AI is bringing to education.Diversity: Diversity of thought, perspectives, and backgrounds helps us serve the wide audience of educators and students around the world.Excellence:  Educators and students deserve the best - and we strive for the highest quality in everything we do."},{"id":358,"posted_on":"2024-11-28","company":"leadtech","company_logo":"https://remotive.com/job/1953864/logo","position":"Backend Developer","category":"Software Development","tags":"{java}","salary":"competitive salary with comprehensive benefits","location":"Spain","apply_url":"https://remotive.com/remote-jobs/software-dev/backend-developer-1953864","description":"ABOUT USAt Macropay, we go beyond the ordinary. We do this by going the extra mile in redefining our partnerships, crafting collaborative payment strategies that maximize profits, and growing our customers' businesses by the minute.We are a dynamic team of online payment, chargeback, and technical specialists with +12 years of experience eager to work side-by-side with our clients and partners while we disrupt the payments ecosystem with the finest tech in the industry, all combined in an exceptional platform where you can find: - Smart and customizable payment routing- Simple & easy transaction routing simulator - Real-time payments and risk KPI monitoring - Checkout experiences adaptable to any business - End-to-end chargeback management solutionsWe are looking for an experienced and passionate Backend Developer to join our Payments team.If you have a creative and innovative mind, Macropay is looking for you!YOUR MISSIONYou’re our perfect candidate if you: Contribute to the design, architecture, and development of our products and services. Produce highly scalable, high-quality software in a fast-paced environment. Find innovative solutions to challenging problems. Improve performance, scalability, and availability of our internal systems. Create tools and processes to increase the productivity of all your co­workers. Diagnose and debug issues in a production environment. RequirementsWHAT WILL MAKE YOU STAND OUT FROM THE CROWD 4+ years programming experience and at least 2 years recent work in Java 2+ years experience in SOA Architecture or/and Microservices. Good Object Oriented Programming knowledge (SOLID, Clean architecture) Experience in Test Driven Development Advanced Knowledge in Web/API environments: HTTP, RESTful, web services ... Ability to work well under pressure and respect deadlines, and have self-learning capabilities. Strong analytical and problem-solving skills. Extra awesomeness scores points! NoSQL Databases (Redis, DynamoDB) Experience with other languages (PHP, Python, Ruby, Go...) Front­end experience with HTML, CSS, Javascript Event Driven Design. Domain Driven Design. Hexagonal Architecture. Serverless Architecture. Experience with Amazon Web Services Experience with agile teams Knowledge of Data Science HIRING PROCESSWe aim to make your hiring journey smooth and transparent, with the following steps: Application review & Initial screening – Our team reviews applications and reaches out for an initial conversation if there’s a match. First interview with the Backend Team Lead and HR. Technical test. Offer – We’re excited to welcome you to the team! Throughout this process, our team is here to answer any questions you may have.BenefitsWHY SHOULD YOU JOIN US?Growth and career developmentAt Macropay, we prioritize your growth. Enjoy a flexible career path with personalized internal training and an annual budget for external learning opportunities.Work-Life balanceBenefit from a flexible schedule with flextime (7 - 9:30 a.m. start, 3:30 - 6 p.m. end -spanish time-) and the option of working full remote or from our Barcelona office. Enjoy free Friday afternoons with a 7-hour workday, plus a 35-hour workweek in July and August so you can savor summer!Comprehensive benefits Competitive salary, full-time permanent contract, and top-tier private health insurance (including dental and psychological services). 25 days of vacation plus your birthday off, with flexible vacation options—no blackout days! Unique Perks If you wish to come, in our office in Barcelona you’ll find it complete with free coffee, fresh fruit, snacks, a game room, and a rooftop terrace with stunning Mediterranean views. Additional benefits include ticket restaurant and nursery vouchers, paid directly from your gross salary. Join us in an environment where you’re free to innovate, learn, and grow alongside passionate professionals. At Macropay, you’ll tackle exciting challenges and be part of a vibrant team dedicated to delivering exceptional user experiencesAbout the companyAt Leadtech, we work hard... and play harder! Our mission is to empower clients and  employees to achieve its goals in the online business world. \nSince 2007, we have been fostering innovative and creative techniques across a multitude of industries, making us pioneers in online project management. \n\nLeadtech is dedicated to constant improvement, as well as inspiring new ideas and methods daily, for both the world in which we live and the future to come.\n\nWe think big... and work bigger, and that's why we do business internationally with over 100 passionate professionals who speak over 15 languages fluently. A global team of focused experts in a range of fields:\n\nWe analyze, we socialize, we write, we code, we design, we calculate, we decide, we collaborate, we generate, we engage, we program, we create… The real question is what don’t we do?! \nWith a truly modern approach to company culture, our values, diversity, flexibility and an active work-play balance are what make Leadtech unique."},{"id":359,"posted_on":"2024-11-28","company":"Constructor","company_logo":"https://remotive.com/job/1953723/logo","position":"Full Stack Engineer: Searchandizing Team","category":"Software Development","tags":"{python,flask}","salary":"base range of 90-110k usd + stock options + work from home bonus","location":"UK","apply_url":"https://remotive.com/remote-jobs/software-dev/full-stack-engineer-searchandizing-team-1953723","description":"Constructor is the only search and product discovery platform tailor-made for enterprise e-commerce where conversions matter. Constructor's AI-first solutions make it easier for shoppers to discover products they want to buy and for e-commerce teams to deliver highly personalized experiences that drive impressive results. Optimizing specifically for e-commerce metrics like revenue, conversion rate, and profit, Constructor generates consistent $10M+ lifts for some of the biggest brands in e-commerce, such as Sephora, Petco, home24, Maxeda Brands, Birkenstock, and The Very Group. Constructor is a U.S. based company that was founded in 2015 by Eli Finkelshteyn and Dan McCormick. For more, visit: constructor.com.RequirementsWe're looking for a passionate and skilled backend engineer to join our Searchandizing team. You'll be responsible for creating and maintaining the tools used by merchandisers of global e-commerce brands to manage their product discovery experience. You'll focus on delivering features for our Searchandizing dashboard, finding innovative ways to improve its usability, and ultimately enhancing the product discovery experience for shoppers worldwide. You'll also play a key role in improving the onboarding process for new merchandisers, making it faster and easier for them to get up and running on the Constructor platform.Requirements Hands on experience with Python. Have strong hands on experience with backend development. Have hands on experience with devops tools like (AWS-ECS, Cloud Watch, ..etc) Have experience launching and operating backend systems. Hands on experience with Flask or similar web frameworks for building APIs is a plus. Have experience with automated testing practices. Experience or willingness to work with the frontend codebase in React and Typescript. Produce high quality code and test their own changes Excellent communication and collaboration skills. A proactive and results-oriented mindset. Experience working in remote environments will be a plus. Benefits  💰Compensation: base range of 90-110k USD + stock options + work from home bonus  🌏 Fully remote team - choose where you live  💸Work from home stipend! We want you to have the resources you need to set up your home office  💻Apple laptops provided for new employees  🚀 Training and development budget for every employee, refreshed each year  👪Parental leave for qualified employees  😎 Work with smart people who will help you grow and make a meaningful impact  ✈️Company retreats all around the world! Diversity, Equity, and Inclusion at ConstructorAt Constructor.io we are committed to cultivating a work environment that is diverse, equitable, and inclusive. As an equal opportunity employer, we welcome individuals of all backgrounds and provide equal opportunities to all applicants regardless of their education, diversity of opinion, race, color, religion, gender, gender expression, sexual orientation, national origin, genetics, disability, age, veteran status or affiliation in any other protected group. Studies have shown that women and people of color may be less likely to apply for jobs unless they meet every one of the qualifications listed. Our primary interest is in finding the best candidate for the job. We encourage you to apply even if you don’t meet all of our listed qualifications."},{"id":360,"posted_on":"2024-11-28","company":"Classgap","company_logo":"https://remotive.com/job/1953662/logo","position":"Online Polish Tutor","category":"All others","tags":"{excel,teaching}","salary":"£20 to £40 per hour","location":"UK","apply_url":"https://remotive.com/remote-jobs/all-others/online-polish-tutor-1953662","description":"We are seeking enthusiastic individuals to join our team as part-time Online Polish Tutors! This fully remote position offers the flexibility to work from anywhere and the freedom to choose hours that fit your schedule.\nTasks\nAs an Online Polish Tutor, you will help students of all ages and levels improve their Polish language skills, covering areas such as speaking, reading, writing, and comprehension. \nNo prior teaching experience is necessary—just a strong command of the Polish language, excellent communication skills, and a passion for teaching. \nYour responsibilities will include creating engaging lesson plans, conducting interactive sessions, and providing personalized feedback to support students in achieving their language learning goals.\n If you love sharing your knowledge of the Polish language and want to make a positive impact on students' learning journeys, we want to hear from you! Join us and help learners excel in Polish through effective online tutoring.\nRequirements\n\nNo previous experience required\n\nBenefits\n\nFlexible schedule\nWork from anywhere in the UK\nOption to work online\nCompensation ranging from £20 to £40 per hour.\n"},{"id":361,"posted_on":"2024-11-28","company":"Mentormate","company_logo":"https://remotive.com/job/1953544/logo","position":"Senior Quality Assurance Engineer","category":"QA","tags":"{automation,jira}","salary":"","location":"Brazil","apply_url":"https://remotive.com/remote-jobs/qa/senior-quality-assurance-engineer-1953544","description":"MentorMate creates durable technical solutions that deliver digital transformation at scale by blending strategic insights and thoughtful design with brilliant engineering. With mature and established practices in enterprise web and mobile development, quality engineering, technical architecture, human-centered design, cloud, DevOps, data, and analytics, the company provides challenging careers in a friendly and global people-oriented environment. We value every team member and share our success through flexible working models, competitive pay and benefits, and advancement opportunities. As part of global technology company Tietoevry Create, MentorMate enables people to work on impactful, global projects for recognizable brands and grow their careers in a team of over 10,000 experts. Together with our sister company Infopulse, also part of Tietoevry Create, we are expanding our team in Brazil and are looking for skilled software development and quality engineering professionals. This collaboration leverages our combined technical expertise to deliver exceptional digital transformation solutions across diverse industries.About the role We’re seeking a Senior QA Engineer with a strong background in mobile application testing for Android and iOS to join our growing mobile development team. The ideal candidate will have a passion for technology and education with an ability to work closely with our product managers and engineers to develop and execute test strategies for a variety of exciting new features. About the team Our Quality Engineers are well-versed in the various dimensions of the QA process, including manual, automated, accessibility, performance, and compatibility testing. With in-house automation testing training and multiple knowledge-sharing and upskilling initiatives, our QA experts help create the next generation of software testing professionals. Responsibilities Participate in the whole lifecycle of software development from planning to release Review business requirements and develop test plans, test cases, test estimations, and test execution reports Perform functionality, regression, integration, UI, smoke, exploratory, stress and performance testing Manage all communications related to QA status on a daily basis and report potential risks during all stages of development lifecycle Work closely with development and product teams to resolve any issues that arise out of the testing process Analyze test results and facilitate resolution of issues Iterate on existing testing processes and standards to improve efficiency and accuracy Requirements 7+ years of work experience in software quality assurance  3+ years focus on mobile testing 2+ years with automation Bachelor's or advanced degree in computer science or a related discipline   Strong knowledge of software QA methodologies, tools, and processes Proficiency in writing test plans, creating test cases, test data, and managing/tracking defect logs Extensive experience in testing web and mobile applications Hands-on experience in test automation tools for mobile applications Experience with CI/CD tools to ensure continuous testing Exceptional attention to detail and commitment to quality Ability to work both independently and on a wide variety of teams Passion for making bulletproof applications and improving education through technology Self-motivated, detail oriented, proactive and collaborative Excellent written and verbal communication skills Knowledge of JIRA, Unix, SQL, JavaScript, CSS, source control, and mobile device development is a plus Scripting or programming experience is a plus Global leaders in digital consulting, design, and engineering services, MentorMate and Tietoevry Create are equal-opportunity employers. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status."},{"id":362,"posted_on":"2024-11-28","company":"quidax","company_logo":"https://remotive.com/job/1953649/logo","position":"Senior Financial Accountant","category":"Finance / Legal","tags":"{\"team management\"}","salary":"","location":"Africa","apply_url":"https://remotive.com/remote-jobs/finance-legal/senior-financial-accountant-1953649","description":"About QuidaxWe are a crypto startup and we are passionate about connecting people to alternative financialsystem. At the core we believe that innovation in money didn’t end with dollars, pounds, and money as we know it today, there has to be something that pushes us as a race forward. We are betting it’s crypto because we’ve seen how it connects the world and makes it significantly smaller financially. Our mission is to make it insanely simple for people to access & experience crypto products. Our vision is to create a world where sending money and value around the globe is as easy as sending a text message, and we believe this future will be brought to you, courtesy of digital currencies.What you will be doingAs the Senior Financial Accountant at Quidax, your role is pivotal to the organization’s financial health and strategic growth. You will serve as a financial leader, ensuring that our financial systems and processes are robust, compliant, and scalable. Working closely with the CFO, you will manage the day-to-day financial operations while implementing strategies to optimize financial performance and mitigate risks.You’ll also play a critical role in building and leading a high-performing finance team, acting as a mentor and ensuring the team aligns with Quidax’s growth objectives. From preparing consolidated financial reports to overseeing cryptocurrency accounting and compliance, your work will directly impact Quidax’s success in the dynamic world of fintech and cryptocurrency.If you’re passionate about combining financial expertise with strategic influence in a fast-paced, innovative environment, this is your opportunity to make a lasting impact.What your day-to-day looks likePrepare and consolidate financial statements (balance sheet, income statement, and cash flow statement) with accuracy and timeliness.Develop and maintain internal financial reporting processes, controls, and compliance with global accounting standards (e.g. IFRS or GAAP).Lead budgeting and forecasting efforts in collaboration with leadership.Ensure proper accounting treatment for cryptocurrency transactions, including valuation, custody, and taxation.Support due diligence processes for potential investments or partnerships.Create and implement financial strategies to improve profitability and manage financial risk.Stay updated on cryptocurrency regulations and accounting trends to ensure organizational compliance.Perform ad-hoc analysis and other related duties as assigned.What you need to have6 - 8 years of experience in financial accounting, preferably in the cryptocurrency, fintech, or technology sectors.A professional accounting qualification (e.g., ACA, ACCA, CPA, or equivalent).Strong analytical, problem-solving, and critical-thinking skills.Experience in preparing consolidated financial statements and managing audits.Knowledge of financial operations of exchanges or digital wallets.A strong understanding of taxation, treasury management, and compliance within the fintech or crypto space.Proven people management experience, with a track record of leading and scaling high-performing teams while fostering a collaborative and results-driven environment.Advanced Excel skills and proficiency with financial software/tools.Excellent organizational and communication skills, with the ability to explain complex financial matters to non-financial stakeholders.Must HavesProven experience in the cryptocurrency or fintech industry.Familiarity with international financial reporting standards (e.g., IFRS or US GAAP).Demonstrated ability to build and scale finance teams in a growing organization.A track record of improving financial systems, processes, and controls.Nice To HavesExposure to crypto-specific tools and platforms.Prior experience working with blockchain or digital asset ecosystems.Familiarity with financial management tools such as NetSuite, QuickBooks, or SAP.Understanding of crypto taxation frameworks in multiple jurisdictions.A passion for the crypto industry and blockchain technology.How to apply:Please send an application tailored to the role that speaks to us. Many people send in bland generic applications, and it is easy and very helpful to stand out, especially when someone has been going through 100 applications, endeavor to make your application a breath of fresh air. We appreciate your great writing and taking the time to assemble your application.We will most likely send you a pre-interview questionnaire if you get through the application stage. Please imagine you are already part of the team and walk us through your thinking about the problems we present.Some perks of being a Quidaxian:A company that cares about you and your well-being and wants to do everything to ensure that your life inside and outside work is the most satisfying it can be.An inclusive culture where we are always looking for improvement and cherish your input. 🙋‍♀️Sweet compensation package, including bonus when the company hits its goals for the year with management's discretion. 🤑Unlimited PTO (Paid Time off). 🥳Generous Parental Leave. 👶HMO. 👨‍⚕️Health & wellness check-ups annually.Offsite team retreat. 🌴Special Interest clubs i.e. book club, fitness club, etc.Also a front-row seat to the biggest thing in finance in the last 100 yearsWhat our hiring process looks likeIt’s a 3-step quick process!✅ Intro call with the recruiter✅ 1 - 2 hrs call with the Hiring Manager(s)✅ 45 mins culture fit interviewIf you want to find out more about what life at Quidax is visit Quidax BioStay connected with Quidax through LinkedIn and Instagram for the latest updates."},{"id":363,"posted_on":"2024-11-28","company":"Trust Machines","company_logo":"https://remotive.com/job/1953376/logo","position":"DevOps Engineer","category":"DevOps / Sysadmin","tags":"{AWS,azure,docker,kubernetes,GCP}","salary":"$120,000—$150,000 usd","location":"USA","apply_url":"https://remotive.com/remote-jobs/devops/devops-engineer-1953376","description":"The mission of Trust Machines is to grow the Bitcoin economy. We’ve recently raised $150M to realize this vision, build Bitcoin apps, and the open-source technologies required to unleash the true potential of Bitcoin for DeFi and Decentralized Applications.About the Opportunity\nWe're looking for a highly skilled DevOps Engineer, to join our remote-first team here at Trust Machines and help us revolutionize the Bitcoin economy through our products. The ideal candidate has a startup background, has built infrastructure from scratch, and a passion for blockchain technology. As our first DevOps Engineer you'll be responsible for designing and implementing robust infrastructure across our products and environments, and play a pivotal role in shaping our product's success.\nWith a focus on autonomy and impact, you’ll collaborate closely with our talented product teams, leveraging your expertise in software testing and infrastructure development to set them up for success. \nWhat You’ll Do:\n\nOwn our infrastructure and environment setup, furthering capabilities across our applications and core engineering objectives.\nProjects will include building new and enhancing existing infrastructure across multiple disparate projects in a way that is compliant with industry best practices, and scalable.\nDive into Web2 and Web3 DevOps projects such as node management, indexer and RPC set up and support \n\nWhat We’re Looking For:\n\nBachelor's degree in Computer Science, Engineering, or equivalent experience\n3+ years of experience in software engineering, ideally in a startup or cryptocurrency projects.\nHigh agency; proven ability to own critical projects with minimal oversight in dynamic environments.\nStrong collaboration skills with experience partnering with development teams to implement DevOps best practices.\nCloud infrastructure expertise: deep knowledge of AWS, GCP, or Azure services, including EC2, S3, and VMs.\nStrong hands-on experience with CI/CD pipelines and automation tools (Jenkins, GitLab CI, CircleCI, or Travis CI).\nStrong hands-on experience with containerization and orchestration (Docker, Kubernetes).\nStrong expertise in Terraform, CloudFormation, or Ansible for automated infrastructure provisioning.\nExperience with Prometheus, Grafana, the ELK Stack, or Datadog for system monitoring and logging. \n\nWe’d Also Like to See:\n\nContributions to open-source projects\nFamiliarity with Bitcoin, Stacks, and other blockchain bridges or decentralized pegs\nExpertise in performance, load, and stress testing \nExperience with security testing and vulnerability assessment\nStrong passion for emerging technologies and shaping the future of finance and decentralization\n\nWhat We’ll Offer:\n\n100% work from home\nFlexible Vacation Policy, take the days you need\nUp to 16 weeks of paid parental leave\nGym & internet reimbursements\nYour choice of technical setup and equipment\nPay Transparency Notice: Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Trust Machines also include equity + token incentives + benefits (including medical, dental, vision and 401(k)). Pay Range: $120,000—$150,000 USD\n\nPlease note that benefits vary by country, the ones shown above are for our full time U.S. based employees. Benefit information for non-US based positions will be provided to individuals who interview for those roles.\nAbout Us\nTrust Machines is proud to be an equal opportunity employer and deeply cares about building a diverse team. Trust Machines is committed to building an inclusive environment for people of all backgrounds. We do not discriminate on the basis of race, color, gender, sexual orientation, gender identity or expression, religion, disability, national origin, protected veteran status, age, or any other status protected by law.\n "}]